[
  {
    "modified_latitude" : 28.594728600709058,
    "created_latitude" : 28.561926400315571,
    "uuid" : "AD1958D4-77B5-45FA-A38E-DAEFD0729217",
    "folder" : 0,
    "content" : "Music with a strong sense of presence. That's what I like.",
    "flagged" : false,
    "accessed_at" : "2023-08-06T15:25:32Z",
    "modified_at" : "2023-08-06T17:12:50Z",
    "languageGrammar" : "Markdown",
    "created_at" : "2023-08-06T15:23:51Z",
    "created_longitude" : -81.164036812336334,
    "modified_longitude" : -81.284629008399662,
    "tags" : [

    ]
  },
  {
    "modified_longitude" : -81.164036812336334,
    "folder" : 0,
    "accessed_at" : "2023-08-06T15:24:28Z",
    "modified_latitude" : 28.561926400315571,
    "modified_at" : "2023-08-06T15:24:31Z",
    "uuid" : "DD30A80A-A456-435C-8118-CBFD0CCCD38D",
    "tags" : [

    ],
    "flagged" : false,
    "created_at" : "2023-08-06T15:24:28Z",
    "content" : "Test 2",
    "created_latitude" : 28.561926400315571,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.164036812336334
  },
  {
    "content" : "Interacting with my younger brother, I often suddenly become aware of how similar my actions and relationship is with my oldest brothers' is to me. This awareness comes on so intensely that I begin to almost see out of my brothers eyes subconsciously. A feeling like deja vu, only instead I get the sense that I've been in the other end of this surprisingly specific type of personal relationship.",
    "created_latitude" : 28.56182317717801,
    "flagged" : false,
    "modified_at" : "2023-08-07T03:34:23Z",
    "modified_longitude" : -81.16680074490715,
    "accessed_at" : "2023-08-07T03:19:18Z",
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.56475495735981,
    "created_at" : "2023-08-07T03:19:18Z",
    "uuid" : "5E982C21-BA99-42F2-ABE8-F8DD3E767EB8",
    "tags" : [

    ],
    "created_longitude" : -81.164014013559679,
    "folder" : 0
  },
  {
    "modified_at" : "2023-08-07T06:27:41Z",
    "modified_longitude" : -81.28459069699727,
    "accessed_at" : "2023-08-07T06:25:29Z",
    "flagged" : false,
    "folder" : 0,
    "modified_latitude" : 28.59441987293998,
    "uuid" : "C3C2E029-3686-4FFB-82DA-14F979BE83D8",
    "languageGrammar" : "Markdown",
    "created_at" : "2023-08-07T06:25:29Z",
    "created_latitude" : 28.59441987293998,
    "tags" : [

    ],
    "content" : "A game about virtual creatures that don't realize they are in a computer simulation. Your character was normal until the day you start playing the game, at which point their consciousness is erased and replaced with yours. A meta game about the relationship between virtual characters and the player.",
    "created_longitude" : -81.28459069699727
  },
  {
    "folder" : 0,
    "accessed_at" : "2023-08-12T23:38:51Z",
    "created_at" : "2023-08-07T06:27:41Z",
    "modified_longitude" : -81.459149777553705,
    "created_latitude" : 28.59441987293998,
    "modified_latitude" : 28.510670832655766,
    "created_longitude" : -81.28459069699727,
    "modified_at" : "2023-08-10T00:16:24Z",
    "content" : "ZenBoarding idea bank:\n\nChapters to denote junctions and sub paths\n\nCostume? Something unique but not obnoxious or overly weird\n\nSome method within the video to visually or audibly what topic I am going to talk about next. Such as speaking out loud, or writing it and showing to the camera\n\n",
    "tags" : [

    ],
    "flagged" : false,
    "uuid" : "3CDC6FE1-ACE1-46AE-AC33-09D165109C08",
    "languageGrammar" : "Markdown"
  },
  {
    "modified_latitude" : 28.577985099300932,
    "modified_longitude" : -81.335140621736457,
    "content" : "Crazy Carts: those drifty carts I saw people scoot around Baldwin Park",
    "created_longitude" : -81.335140621736457,
    "tags" : [

    ],
    "modified_at" : "2023-08-12T23:44:37Z",
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-08-12T23:44:06Z",
    "uuid" : "4C2E5087-CB36-416E-8B2F-7FB1CCEA9BA9",
    "created_at" : "2023-08-12T23:44:06Z",
    "folder" : 0,
    "created_latitude" : 28.577985099300932,
    "flagged" : false
  },
  {
    "modified_longitude" : -81.21471608500957,
    "content" : "For a moment I fully believed that the question of choosing betrrrn ",
    "accessed_at" : "2023-08-17T20:51:15Z",
    "uuid" : "33EDE4E8-3F1D-482C-95C0-401F52734AE0",
    "created_longitude" : -81.21471608500957,
    "created_at" : "2023-08-17T20:51:15Z",
    "flagged" : false,
    "created_latitude" : 28.597403231927462,
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "modified_latitude" : 28.597403231927462,
    "folder" : 0,
    "modified_at" : "2023-08-17T20:52:11Z"
  },
  {
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-08-21T20:33:11Z",
    "modified_longitude" : -81.280110916198495,
    "uuid" : "420D22D9-19A9-48E5-B95B-BE1547A9DE3C",
    "created_longitude" : -81.284448285240614,
    "modified_latitude" : 28.574487897594061,
    "created_at" : "2023-08-21T13:33:53Z",
    "content" : "I was getting lost in a game I didn't even need to play.\n\nThe worldview I was given, the assumptions about the nature of the world and my place in it that, as a child, I was naturally receptive to, it was all untrue. \n\nThose assumptions were:\n\n- I am inherently lower value than others. My natural state is incorrect and in need of improving.\n- I must 'earn' friendship, love, and respect as a result of this inferiority.\n- Any failure to 'earn' these is evidence of inherent inferiority, and a confirmation of these assumptions.\n\nI was never explicitly directed to believe these ideas. I simply was in an environment where they were induced to be my beliefs. I wasn't painted a picture of the world, \nIt's the existential equivalent riding the current, not fighting against it.\n\nIt's seeing my true nature as just that; natural.",
    "created_latitude" : 28.594519488960263,
    "accessed_at" : "2023-08-21T20:29:46Z",
    "tags" : [

    ],
    "folder" : 0
  },
  {
    "folder" : 0,
    "created_longitude" : -81.283212849597476,
    "tags" : [

    ],
    "accessed_at" : "2023-08-22T02:40:30Z",
    "languageGrammar" : "Markdown",
    "created_at" : "2023-08-22T02:40:30Z",
    "uuid" : "484BBE9E-B8C4-49E0-86B8-65D5417CEEF0",
    "content" : "My mind has been changing before me these past few weeks. I waited to write about it because I wanted to prove to myself that it was not some random maniac-style episode that I was experiencing. Instead, the shift seems to be marching on, possibly getting even greater as the weeks go on. The nature of my thoughts, their dispositions, their energy and intentions. The frequency of the self-torture of reliving triggering life events or triggering repeated thoughts that I have carried with me for so many years. All of it has slowly shifted from negative to positive. It's been subtle but noticeable, and I sense myself hesitating heavily to commit to writing this, but I feel like it truly is growing more and more as the days pass. Part of me feels as if I should write \"I pray it continues\" which I feel as though is creating some dissonance within me, which is honestly interesting. Regardless, I need to understand more, and I feel like I will soon, which feels really great.",
    "created_latitude" : 28.595087123770163,
    "modified_at" : "2023-08-22T02:55:43Z",
    "flagged" : false,
    "modified_latitude" : 28.595087123770163,
    "modified_longitude" : -81.283212849597476
  },
  {
    "modified_at" : "2023-08-22T03:10:06Z",
    "created_at" : "2023-08-22T02:59:30Z",
    "accessed_at" : "2023-08-22T02:59:30Z",
    "uuid" : "1EED712C-D1F4-4733-B128-0A00DF0CC91F",
    "created_longitude" : -81.284447252476738,
    "modified_longitude" : -81.28444749999376,
    "content" : "Are we gonna eventually get to the point in technology where one could live in a perfect realistic simulation of every job in the world for days, weeks, even months of virtual time? Of course, this would be best if real time passed extremely slowly. You could live for a year in the virtual world simulation of living as someone who works as a nurse would be like, coming back to reality to have only hours pass. College graduates could take their time, test out a career, and perhaps just as importantly, get on the job experience and skills. Such skills for certain areas are hard to attain in a classroom, so a simulation of the job could be uniquely useful, and could potentially save real human lives from malpractice or other accidents due to inexperience. This level of technology would probably render jobs obsolete regardless, anyways...",
    "tags" : [

    ],
    "folder" : 0,
    "flagged" : false,
    "modified_latitude" : 28.594524192278175,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594524639601264
  },
  {
    "modified_latitude" : 28.594519411689166,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "created_at" : "2023-08-22T21:24:58Z",
    "modified_at" : "2023-08-22T21:30:19Z",
    "created_latitude" : 28.594519411689166,
    "created_longitude" : -81.284433323729345,
    "modified_longitude" : -81.284433323729345,
    "accessed_at" : "2023-08-22T21:24:58Z",
    "folder" : 0,
    "flagged" : false,
    "content" : "An indie game where the voices ARE themselves the characters. Characters are distinguished by their spatial location to the player, along with pitch, tone, static, vibration, or many other parameters. There may well be a lot to explore in this direction of art. Perhaps a booming voice from above is a God, or the player themselves. There may also be unique game mechanics to be developed here as well.",
    "uuid" : "2A69442B-AAAA-464D-ABA6-05424AD43491"
  },
  {
    "modified_latitude" : 28.594519411689166,
    "created_at" : "2023-08-23T04:56:21Z",
    "created_longitude" : -81.284433323729345,
    "folder" : 0,
    "accessed_at" : "2023-08-23T04:56:21Z",
    "modified_longitude" : -81.284433323729345,
    "content" : "",
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "modified_at" : "2023-08-23T04:56:35Z",
    "created_latitude" : 28.594519411689166,
    "uuid" : "395DC4A5-CF46-4964-A985-BB8E78216350",
    "tags" : [

    ]
  },
  {
    "folder" : 0,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "content" : "A possible way a 'Time Machine' could work is if it could perform the following series of godlike feats. First, it must have the ability to observe every single particle in the universe at once. Not only that, it must record or otherwise understand every physical property of each particle, both known and those yet to be discovered. Momentum, mass, charge, and countless more would all need to be accessible by this machine. After this simple task, it must then repeat this recording process, now for the particles at the position they will or shall be in your destination time. Finally, the machine must act on all particles, at once, interpolating all properties to exactly their destination particle values.\n\nThere are quite obviously a few logical holes in this hypothetical machine. For one thing, I sincerely hope that the interpolation would be done truly instantaneously. It doesn't necessarily require it to be instant, as long as the state of each particle end is correct at the moment of time desired to arrive at. I can imagine what it would look like to be able to see an alternate universe where such a machine is activated but takes 1 year to complete the interpolation process. Yes, I see the absurdity in working with time in this particular writing, but I also see you frozen in time, individual particles invisibly but steadily shredding them apart into unrecognizable mush in all directions. Even just one nanosecond after activation, all living things cease to be alive, as every single atom that is positioned just right as to create the concept of \"you\" would be shifted out of place. So slightly out of place, that the collective combination of all these microscopic changes form to a new set of particles that is, empirically speaking, not \"you\". If we could abort the process one nanosecond into it, all humans would just slump to the ground. No longer human but instead a strange pile of meat, you would be an 'almost' human. It's admittedly hard to picture what it's like to see such a thing, visually and contextually.\n\nAnother problem is the safety of the operator and the Time Machine itself. Perhaps it can target all particles but itself and its passengers, but all particles must be accounted for. If particles are missing, time will surely flow differently, and who knows what would happen then.",
    "modified_longitude" : -81.28448493920574,
    "modified_latitude" : 28.594943310737953,
    "created_latitude" : 28.594946240738455,
    "uuid" : "2EDE26C7-B81B-4308-9A8A-54B3098113CC",
    "accessed_at" : "2023-08-23T05:33:27Z",
    "created_longitude" : -81.284484777746471,
    "created_at" : "2023-08-23T05:01:39Z",
    "modified_at" : "2023-08-23T06:11:46Z",
    "flagged" : false
  },
  {
    "modified_latitude" : 28.594519411689166,
    "created_latitude" : 28.594519411689166,
    "modified_longitude" : -81.284433323729345,
    "content" : "A story about a world where the souls of humans reincarnate after death. The main character discovers that their soul has the inexplicable desire to return to, find, or otherwise interact with some millennia old object. Millions of cycles of life and death have passed with this mystery still unsolved, despite the extensive history of attempts to explain, understand, and potentially beat this obsession. Witnessing the same soul in different bodies across time attempting to solve a spiritual mystery sounds like quite the story indeed.",
    "accessed_at" : "2023-08-23T21:43:21Z",
    "languageGrammar" : "Markdown",
    "created_at" : "2023-08-23T21:43:21Z",
    "created_longitude" : -81.284433323729345,
    "flagged" : false,
    "uuid" : "E5B9FE8C-3378-4A22-A3D0-275A1FD847E2",
    "folder" : 0,
    "modified_at" : "2023-08-23T21:51:14Z",
    "tags" : [

    ]
  },
  {
    "flagged" : false,
    "folder" : 0,
    "modified_latitude" : 28.570824558085857,
    "tags" : [

    ],
    "created_at" : "2023-08-24T01:17:18Z",
    "modified_longitude" : -81.22928797700753,
    "content" : "An album cover that is is vintage photo of a smart phone that has the actual album cover on it. The phone is off center and gives the appearance that the photo was taken accidentally or that the phone wasn't the main subject of the photo ",
    "created_latitude" : 28.570870993237754,
    "created_longitude" : -81.229265916513484,
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-08-24T01:22:07Z",
    "uuid" : "364A3088-931B-4E2E-96A0-2856EDA75138",
    "modified_at" : "2023-08-24T01:23:44Z"
  },
  {
    "tags" : [

    ],
    "modified_longitude" : -81.284554749552228,
    "folder" : 0,
    "created_at" : "2023-08-25T23:03:41Z",
    "modified_at" : "2023-08-26T00:16:27Z",
    "flagged" : false,
    "modified_latitude" : 28.594596521155403,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594601353378323,
    "accessed_at" : "2023-08-25T23:59:49Z",
    "content" : "While right now I preferred to draw this thought rather than write it (which coincidentally ties into the thought itself), I don't have a way to add drawings here. And, if not stored here, then some other secure, convenient, and chronological way to store them elsewhere. I certainly need to create that personal website and app combo soon.\n\nAnyways the point is one I possibly made before, and has no doubt also been widely said countless times but: In the process of story telling or otherwise transferring information from one human to another, there has always been contention between the one who is expressing and the one who is interpreting. The Expressor has, like all people, a brain that doesn't store memories as \"photos\" or \"videos\" but rather employs the imagination center to recreate the memories through particular neural firings. Essentially, our true perception of a memory and the specific details within it, is not one true thing but rather a ever evolving cloud of \"believable-enough\" variations of a memory. The cloud grows and changes and perhaps even shrinks as age progresses, but it is all the same memory. I can't help but think about what, if the above baseless, groundless theory is true, then could one make the argument that you can never own a perfect and exact memory in your mind, and that they don't truly exist at all.\n\nGoing back to the point again, as memories are  both highly intricate as well as in constant flux, the Expressor has a difficult and frustrating role. What I have come to understand is that as the concept of language evolved, the Expressor has had that burden reduced gradually. Likewise, the Interpreter, who has immemorially the burden of receiving low detail information from the Expressor and has to work to fill in the gaps with their own imagination, has found their level of effort reducing in the same way. Before spoken language, to communicate was to do high levels of physical and mental activity on both sides of the exchange. Expressors had to use tools of expression beyond their mouth, like their body, or props and emotion. Interpreters had to contend with misinterpretation, as well as a higher likelihood of conflicting interpretation between people as well as internally. Spoken and written language was a incredibly powerful tool, as it could be robust enough to hold an unlimited number of concepts, yet simple enough to quickly and, most importantly, unambiguously, convey information to a massive number of people. Storytellers, the Expressors, they had an immensely easier job getting the memory that they could see in the moment out into the world before it became too different. They also could now record their memory in as granular detail as they like, permitting their dedication and the current boundaries of the dictionary. The Interpreters in this time of history had much of their burden reduced, but there is still enough effort in imagining as you read a novel that plenty interpretation is still present.\n\nFinally, we get to the present, where the tools to express yourself are numerous and freely available. Many of them are also allow a level of detail perhaps as powerful as the jump to verbal language. Virtual Reality, film, or other technologically advanced areas of expression are allowing us to finally reach something one could call the \"singularity\" of expression. This would be when the Expressor... expresses and art is done, that is absolutely, exactly, what the Expressor envisioned to the most precise detail. And perhaps because of this, the Interpreter has zero burden, is offered no room for interpretation.",
    "uuid" : "E64DC315-3397-4EAB-89E9-810128A60952",
    "created_longitude" : -81.284555821800495
  },
  {
    "folder" : 0,
    "flagged" : false,
    "created_longitude" : -81.310678946078326,
    "content" : "Should my urge to either run away to, or devote my life to, a land of humanistic love and compassion be stronger than it feels now?",
    "created_at" : "2023-08-26T22:32:37Z",
    "uuid" : "7C52EC41-A074-4DA8-8F21-170D63D79EA4",
    "modified_latitude" : 28.52493957753866,
    "accessed_at" : "2023-08-26T22:32:37Z",
    "created_latitude" : 28.54112453368182,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-08-26T22:36:07Z",
    "modified_longitude" : -81.3105162763555
  },
  {
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-08-26T22:36:14Z",
    "folder" : 0,
    "uuid" : "076D25C5-0546-49B4-BD51-A10D8E5D3E6C",
    "content" : "It very well is an art, based solely on it's required time and effort, to place commas in a writing style such as mine. Recently, especially.",
    "created_longitude" : -81.3105162763555,
    "flagged" : false,
    "created_latitude" : 28.52493957753866,
    "tags" : [

    ],
    "modified_at" : "2023-08-26T22:37:58Z",
    "modified_latitude" : 28.52493957753866,
    "created_at" : "2023-08-26T22:36:14Z",
    "modified_longitude" : -81.3105162763555
  },
  {
    "modified_longitude" : -81.198290910272988,
    "flagged" : false,
    "modified_at" : "2023-08-28T18:50:47Z",
    "tags" : [

    ],
    "uuid" : "A1128173-B806-4112-9FE0-565BF597D7E5",
    "created_at" : "2023-08-28T18:50:15Z",
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.602915574609206,
    "created_longitude" : -81.198290910272988,
    "content" : "A Stick Ranger game but juiced up with AI",
    "modified_latitude" : 28.602915574609206,
    "accessed_at" : "2023-08-28T18:50:15Z"
  },
  {
    "modified_at" : "2023-08-31T18:18:47Z",
    "created_at" : "2023-08-31T18:14:11Z",
    "flagged" : false,
    "content" : "Is fear of death and fear of the unknown two names for the same mechanism? Death might be considered the ultimate unknown, but it may not all encompassing.",
    "modified_longitude" : -81.206360050068582,
    "created_longitude" : -81.2075802067545,
    "modified_latitude" : 28.56664861722717,
    "tags" : [

    ],
    "created_latitude" : 28.56702915045949,
    "folder" : 0,
    "uuid" : "6EEDC7D1-400E-42D5-AF2F-E1748C56038F",
    "accessed_at" : "2023-08-31T18:14:11Z",
    "languageGrammar" : "Markdown"
  },
  {
    "modified_latitude" : 28.56664861722717,
    "uuid" : "D4E654C6-7A49-4F29-9232-3425B3C9AB46",
    "modified_at" : "2023-09-01T02:15:14Z",
    "created_at" : "2023-09-01T02:12:43Z",
    "accessed_at" : "2023-09-01T02:12:43Z",
    "created_longitude" : -81.206360050068582,
    "flagged" : false,
    "folder" : 0,
    "modified_longitude" : -81.206360050068582,
    "created_latitude" : 28.56664861722717,
    "content" : "It's as if we evolved to tell stories but not the capacity to perceive them as such.",
    "tags" : [

    ],
    "languageGrammar" : "Markdown"
  },
  {
    "content" : "",
    "uuid" : "E23671B0-E897-40E7-A763-9DF7E544485B",
    "created_latitude" : 32.808773652960184,
    "flagged" : false,
    "created_at" : "2023-09-04T03:39:53Z",
    "created_longitude" : -117.21878563055832,
    "folder" : 0,
    "accessed_at" : "2023-09-04T03:39:53Z",
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-09-04T03:42:09Z",
    "modified_longitude" : -117.21889622875975,
    "tags" : [

    ],
    "modified_latitude" : 32.808976657020217
  },
  {
    "accessed_at" : "2023-09-05T02:14:23Z",
    "flagged" : false,
    "content" : "My name is Ahmed Ali Mansour.",
    "created_at" : "2023-09-05T02:10:40Z",
    "modified_latitude" : 28.594952490350824,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284787049244599,
    "modified_longitude" : -81.285334257389721,
    "modified_at" : "2023-09-05T02:14:28Z",
    "uuid" : "0205B6BE-5602-4543-81F6-72CDD3CA8AC6",
    "folder" : 0,
    "created_latitude" : 28.594785955595107
  },
  {
    "modified_at" : "2023-09-05T02:31:25Z",
    "content" : "Until this THC cart I got from San Diego runs out or I stop because I dislike it, I want to try to record a voice recording into here or Obsidian, and just talk about my trauma out loud. \n\nThis writing simply exists to be brought into existence. The me that may or may not be me the me in me' head chose to open this app and deliver the necessary complex signals to my fingers as to type this in. Which took nearly 45 minutes, I am appalled to continue to write. For reasons you may suspect.",
    "modified_latitude" : 28.594954108429739,
    "created_latitude" : 28.595313930321968,
    "tags" : [

    ],
    "created_longitude" : -81.283579997419096,
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "modified_longitude" : -81.285342538161316,
    "folder" : 0,
    "uuid" : "8006FD14-10D4-42C7-BF92-8083A802F2F1",
    "accessed_at" : "2023-09-14T04:28:34Z",
    "created_at" : "2023-09-05T02:10:54Z"
  },
  {
    "tags" : [

    ],
    "flagged" : false,
    "created_at" : "2023-09-05T22:10:40Z",
    "created_latitude" : 28.871669856904155,
    "modified_at" : "2023-09-05T22:29:15Z",
    "content" : "The invention and subsequent spread of music recording and playback into more peoples homes was also the spread of influence over the lives of children who now could have music be a larger part of their future. Those born to bodies and grow around churches or more affluent areas of society could now instead have a life beholden with music anywhere in the world. The Mozarts and Beethovens and the other more (lucky?) lives had the access they needed. In other words, it was the democratization of the right to music.",
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.281848484725955,
    "accessed_at" : "2023-09-05T22:10:40Z",
    "uuid" : "AF7FBDD4-B249-44B3-B1C0-19CB4CEE8DF5",
    "modified_latitude" : 28.871883689452773,
    "created_longitude" : -81.286784828764667
  },
  {
    "modified_longitude" : -81.24469788545062,
    "uuid" : "2AB83E36-D31E-407A-B941-03BFCEA0884E",
    "content" : "The largest wall within my mind continues to be my aversion to vulnerability and rejection. While there is very real feeling of progress towards conquering this wall, the feeling of stepping into a whole new world permeates as just deeply.",
    "created_longitude" : -81.20755519428937,
    "tags" : [

    ],
    "modified_at" : "2023-09-06T20:15:14Z",
    "folder" : 0,
    "flagged" : false,
    "created_at" : "2023-09-06T20:02:30Z",
    "accessed_at" : "2023-09-06T20:15:03Z",
    "created_latitude" : 28.611435125213784,
    "modified_latitude" : 28.648427675066674,
    "languageGrammar" : "Markdown"
  },
  {
    "created_latitude" : 28.594518853909374,
    "modified_longitude" : -81.284429318820813,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284429318820813,
    "accessed_at" : "2023-09-07T16:00:13Z",
    "content" : "A drone or drone flying program that is designed to fly next to someone and mimic the camera movements of a real human cameraman. Tracking the ground to keep a certain distance, it would bob up and down to match the natural motions that a handheld shot usually has.",
    "flagged" : false,
    "created_at" : "2023-09-07T16:00:13Z",
    "modified_at" : "2023-09-07T16:03:48Z",
    "uuid" : "F9C94582-EDBA-42E5-8CC9-3D5FE49662A3",
    "tags" : [

    ],
    "folder" : 0,
    "modified_latitude" : 28.594518853909374
  },
  {
    "uuid" : "372DF108-EAEB-40B5-B721-88754037A2CF",
    "modified_at" : "2023-09-07T19:12:09Z",
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "created_longitude" : -81.223735125592754,
    "accessed_at" : "2023-09-07T19:10:36Z",
    "created_latitude" : 28.597332953058817,
    "modified_latitude" : 28.598076559478731,
    "modified_longitude" : -81.218724531384694,
    "tags" : [

    ],
    "created_at" : "2023-09-07T19:10:36Z",
    "content" : "",
    "flagged" : false
  },
  {
    "uuid" : "D8CFAB99-343F-4072-A4A8-F671B4BA81A3",
    "created_latitude" : 28.572690991344839,
    "folder" : 0,
    "flagged" : false,
    "content" : "If my older brothers are oil and water, that makes me the whisk.",
    "created_longitude" : -81.286031390818394,
    "modified_longitude" : -81.28639787726307,
    "created_at" : "2023-09-07T20:41:59Z",
    "modified_at" : "2023-09-07T20:43:10Z",
    "modified_latitude" : 28.581169522670006,
    "accessed_at" : "2023-09-07T20:41:59Z",
    "tags" : [

    ],
    "languageGrammar" : "Markdown"
  },
  {
    "accessed_at" : "2023-09-08T17:47:54Z",
    "modified_at" : "2023-09-08T18:14:43Z",
    "created_latitude" : 28.594798828786178,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.285054784994458,
    "modified_latitude" : 28.594784999804205,
    "created_at" : "2023-09-08T17:32:31Z",
    "flagged" : false,
    "folder" : 0,
    "tags" : [

    ],
    "content" : "I suppose one conviction I've held is that (nearly) all pornography is in some way immoral on a spiritual or mental level. The reasoning has shifted between shame and fear to despair and envy, and every mixture of emotion in between. Fear of being caught in vulnerability, shame in said exposure during the experience, despair in the moments of intentionally induced panic by others. And more recently, envy at the sight of the material and what it becomes in my mind.\n\nAfter some pondering about this belief of mind, I realized perhaps a core element that this negativity within me stems from. It is yet another conviction of mine, which I feel just as strongly about. I believe that all sexual energy that one has should be appropriately diverted away from one sided activities and towards consenting partners. Pornography and the solo masturbation that often comes with it is nothing more than a waste of fortuitous and boundless supply of energy we are given.\n\nThese beliefs may change over time, and perhaps I've described them incorrectly here, but somewhere in the ideas above are my ideals. I'm personally not feeling very close either of them at the moment.",
    "uuid" : "B8726320-9790-48C7-B192-048392F3AB3A",
    "modified_longitude" : -81.284966168920747
  },
  {
    "tags" : [

    ],
    "created_at" : "2023-09-08T21:16:21Z",
    "flagged" : false,
    "created_longitude" : -81.197761968189241,
    "modified_longitude" : -81.199556946451381,
    "accessed_at" : "2023-09-08T21:16:21Z",
    "folder" : 0,
    "content" : "We need a new word for liking something ironically. The internet and culture in recent years have certainly shown its power and veracity.",
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-09-08T21:21:01Z",
    "modified_latitude" : 28.599031881252152,
    "uuid" : "188A07F8-2748-4340-9A03-4A07B5E38B4A",
    "created_latitude" : 28.599884820519584
  },
  {
    "created_latitude" : 28.594508318698466,
    "languageGrammar" : "Markdown",
    "uuid" : "EF9BBD28-502E-4F23-A983-BB59C169B400",
    "created_at" : "2023-09-09T20:03:03Z",
    "created_longitude" : -81.284431586881055,
    "tags" : [

    ],
    "modified_longitude" : -81.284431886378059,
    "accessed_at" : "2023-09-09T20:03:03Z",
    "content" : "I can certainly see how the desire I've been holding as of late, the drive to shepherd those in my family towards openness and understanding, can quickly turn to obsession. In my mind I see myself upon a cliff of this particular vice, on high awaiting a rocky void of inescapable preoccupation. And it is the moments of clarity, the jolts back to reality— most crucially, the value is that is gained from the act of writing this very note, that are to me the rocks and stones that begin to shift and roll between my feet. They all in their own way, the sound of those stones and the gravelly sand that spray in the air and around my feet, which are slowly sinking further downward, down in an spiritually disturbing and irreversible manner. This perception along with the feeling they elicit certainly do enough to remind myself to step back, breathe, and reevaluate.",
    "flagged" : false,
    "modified_at" : "2023-09-09T20:23:44Z",
    "modified_latitude" : 28.594508453645219,
    "folder" : 0
  },
  {
    "created_at" : "2023-09-10T05:25:52Z",
    "created_latitude" : 28.594508082879159,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "modified_longitude" : -81.284431754630859,
    "content" : "What is the most impactful piece of art that is an attempt to make something that one desires most to forget they encountered it? To what emotion would I appeal to?",
    "uuid" : "F7F0EABA-7DE1-4F5D-A252-2A0B9E2BEB01",
    "created_longitude" : -81.28443176267109,
    "modified_latitude" : 28.594508079257718,
    "accessed_at" : "2023-09-10T05:30:34Z",
    "flagged" : false,
    "modified_at" : "2023-09-10T05:30:53Z"
  },
  {
    "modified_longitude" : -81.284431754631328,
    "folder" : 0,
    "tags" : [

    ],
    "modified_at" : "2023-09-10T06:25:49Z",
    "flagged" : false,
    "created_at" : "2023-09-10T05:44:20Z",
    "modified_latitude" : 28.59450807925792,
    "uuid" : "03E7D182-1CC9-4B4E-91D5-A1239CEA4CA7",
    "created_longitude" : -81.284431483202724,
    "created_latitude" : 28.594507957002126,
    "content" : "Is the existence of my need for evidence of a claim from another person a spiritual failing me or them? I am realizing, now, that this battle of Egos is in essence another facet of the same crux that is the human condition. It is exactly here that separates this world from the ideal one I can imagine within me. Instant, inherent trust in the words and actions of others requires a society where all participants ",
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-09-10T06:18:27Z"
  },
  {
    "folder" : 0,
    "modified_longitude" : -81.283775406507942,
    "created_latitude" : 28.59450807925792,
    "tags" : [

    ],
    "created_longitude" : -81.284431754631328,
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.594212449535991,
    "modified_at" : "2023-09-10T06:18:17Z",
    "created_at" : "2023-09-10T06:06:37Z",
    "accessed_at" : "2023-09-13T00:46:52Z",
    "flagged" : false,
    "uuid" : "66B92EC0-FEDE-4895-BC55-B5D4926E1B95",
    "content" : "The Ego is said to be like a house of cards, and it's death like the knocking over of the whole stack. If that's true, and if each card could be said to be a complex or other negative mental chain one has, then I can only hope that I am well on my way reaching such a lovely demise. "
  },
  {
    "modified_at" : "2023-09-10T16:29:00Z",
    "modified_latitude" : 28.594520719625603,
    "created_longitude" : -81.284403915994744,
    "uuid" : "D99E194F-83AC-42CD-9994-BF2933AA5ED8",
    "created_latitude" : 28.594520719625603,
    "accessed_at" : "2023-09-10T16:26:45Z",
    "folder" : 0,
    "modified_longitude" : -81.284403915994744,
    "content" : "Living 1 life to let others live 10 so that others still may live 100.",
    "tags" : [

    ],
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-09-10T16:26:45Z"
  },
  {
    "accessed_at" : "2023-09-10T16:57:12Z",
    "modified_latitude" : 28.647661238141243,
    "created_latitude" : 28.608873985148517,
    "created_longitude" : -81.288562518065632,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-09-10T16:57:12Z",
    "uuid" : "9E616A10-18E3-4115-A3DC-6185B1B95751",
    "modified_longitude" : -81.258642779685488,
    "tags" : [

    ],
    "content" : "Some complex within me surely operates something like this: my romantic and sexual attraction to someone, when expressed or channeled through physical appearance, is subconsciously perceived through the lens of shame and guilt. It's this aversion that aids in both self-rejection of potential partners but also guides me towards relationships where such feelings become recurrent, constrictive, and most perhaps most destructively, ripe for manipulation.",
    "folder" : 0,
    "flagged" : false,
    "modified_at" : "2023-09-10T17:07:48Z"
  },
  {
    "created_latitude" : 28.622555984017087,
    "folder" : 0,
    "modified_longitude" : -81.261436639170881,
    "accessed_at" : "2023-09-10T19:23:17Z",
    "flagged" : false,
    "created_longitude" : -81.260442683679614,
    "content" : "Another complex or maybe a ",
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "modified_latitude" : 28.622272561177009,
    "uuid" : "18F39CF1-A8AB-47AA-A2C6-911C45271B89",
    "modified_at" : "2023-09-10T19:24:07Z",
    "created_at" : "2023-09-10T19:23:17Z"
  },
  {
    "created_longitude" : -81.266645878529417,
    "tags" : [

    ],
    "created_at" : "2023-09-10T19:27:20Z",
    "modified_longitude" : -81.284433581323,
    "uuid" : "BC1EA0E0-0BA5-4B4C-8D1A-67DCC058C6DD",
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-09-13T17:37:37Z",
    "flagged" : false,
    "modified_latitude" : 28.594526267809769,
    "created_latitude" : 28.619634026136254,
    "content" : "Hey future therapist(s?) reading this! Thanks for agreeing to read these usually private notes I take often. If not properly explained by me orally, allow me in the past to give you full context.\n\nThese notes started from the adherence to the advice of writing your thoughts down somewhere as a way to make mental health progress. I understood that writing gives you mental clarity, especially in moments of high stress. With clarity comes a reduction in the racing anxious thoughts that ruled my life in often contrived ways. Like most things in the world, it took a painfully long time to notice an improvement. Looking back at my phones notes, it's nearly exactly been a year as of current writing (9\/10\/2023) since my first note that was related to mental health or psychology (9\/5\/2022), which is amusing and honestly really interesting.\n\nThe final context you should know is that in my mind, this writing will one day be up for public viewing, at least in some capacity. My current plan is to have this on my personal website as a blog\/art piece\/the sharing of an answer of a question that is one of my big life goals, truthfully. The question being: if one could collect all the thoughts and other data from within the mind out, and into a computer from which to perform all sorts of statistical and machine learning analysis upon it... what could you learn?\n\nTherefore, I would humbly require you and any other reader to keep close a single truth as you traverse these writings. Put simply, it is that as you wander through here, you accept and defend only that one truth. That is not to say that no truth exists somewhere along the endless walls of scribbles you see. This nuance should and frankly must be appreciated and presumed. Truly, my objective with these writings is sincerely to record the exact stream of consciousness to the best of my ability. To speculate further is foolish and irrelevant.\n\nSometime soon I hope to write a simple iOS app so that I may write more quickly and efficiently, as well as collect more specific data. Things like, if I'm intoxicated as I'm writing, on what substance and to what degree, quick voice clips with no hassle, etc. These desires are quite obvious to me as I write this, thinking of all the attempts in the past. Regardless, after a while it, or I could say this, became something I want to do rather had to fight to do.\n\n(9\/13\/23):\n\nI hope you can help the current me you know, cause past me believes he's close to getting it, he just needs a little help.\n\nTell him I said get to work on that app ;)",
    "accessed_at" : "2023-09-11T20:38:01Z"
  },
  {
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-09-10T21:02:55Z",
    "modified_longitude" : -81.198796554862341,
    "modified_latitude" : 28.590088493779444,
    "created_latitude" : 28.590088493779444,
    "created_at" : "2023-09-10T21:00:32Z",
    "created_longitude" : -81.198796554862341,
    "uuid" : "62D7D850-24F2-44E5-8284-4EB224470F2D",
    "content" : "If someone asks me how I've made my mental health progress, I truly hope that I remember to say that it's \"simply equal parts introspective writing, meditation, and a year to waste!\", to thunderous laughter.",
    "tags" : [

    ],
    "folder" : 0,
    "accessed_at" : "2023-09-10T21:00:32Z"
  },
  {
    "modified_latitude" : 28.561813496079857,
    "modified_longitude" : -81.164014348835849,
    "folder" : 0,
    "created_latitude" : 28.571852615733718,
    "created_at" : "2023-09-10T21:37:52Z",
    "accessed_at" : "2023-09-10T21:46:46Z",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "content" : "The question of \"how long will my mental or spiritual journey take?\" Is rather strikingly revealing. While not inherently bad, it seems to show that one has not yet intuit the truth of the matter. ",
    "created_longitude" : -81.19835923074811,
    "modified_at" : "2023-09-10T21:49:15Z",
    "flagged" : false,
    "uuid" : "5D69F322-D149-4BC0-9583-8808176471AC"
  },
  {
    "uuid" : "4D90BB72-41DC-4C85-9F72-A77F4A61A27C",
    "folder" : 0,
    "created_latitude" : 28.568153716724535,
    "modified_longitude" : -81.284430893068418,
    "modified_latitude" : 28.594518613959337,
    "content" : "",
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "tags" : [

    ],
    "created_at" : "2023-09-11T01:09:55Z",
    "accessed_at" : "2023-09-11T01:18:25Z",
    "modified_at" : "2023-09-11T01:19:24Z",
    "created_longitude" : -81.252985746552909
  },
  {
    "created_latitude" : 28.594518613959337,
    "flagged" : false,
    "created_at" : "2023-09-11T01:22:56Z",
    "accessed_at" : "2023-09-11T01:22:56Z",
    "content" : "It must be said, I am nothing but excited to explore the realms of thought I have ahead of, equipped with this current lens that I somehow stepped into maintaining as of late. It's easy to sense the mountains of questions and moral decisions still await, and it comfortably feels invigorating to feel my eagerness throughout my  self and myself.",
    "folder" : 0,
    "uuid" : "12C5A747-D5E4-43DF-A3B4-7E03B7E43BFF",
    "modified_at" : "2023-09-11T01:33:40Z",
    "created_longitude" : -81.284430893068418,
    "modified_longitude" : -81.284430893068418,
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.594518613959337,
    "tags" : [

    ]
  },
  {
    "created_latitude" : 28.594518613959337,
    "flagged" : false,
    "content" : "I wonder if the great savants of centuries past like Da Vinci, Mozart, and ",
    "created_at" : "2023-09-11T01:33:48Z",
    "accessed_at" : "2023-09-11T01:33:48Z",
    "folder" : 0,
    "tags" : [

    ],
    "created_longitude" : -81.284430893068418,
    "modified_longitude" : -81.284430893068418,
    "modified_at" : "2023-09-11T01:35:28Z",
    "modified_latitude" : 28.594518613959337,
    "uuid" : "4B802729-925A-4156-963E-134B3CB50559",
    "languageGrammar" : "Markdown"
  },
  {
    "created_longitude" : -81.198871410505177,
    "folder" : 0,
    "modified_longitude" : -81.198871410505177,
    "tags" : [

    ],
    "created_at" : "2023-09-11T17:54:05Z",
    "flagged" : false,
    "created_latitude" : 28.590129679699817,
    "modified_latitude" : 28.590129679699817,
    "modified_at" : "2023-09-11T17:54:18Z",
    "uuid" : "AC46F3AE-60D0-4B59-94B8-B30D4F9C4BBE",
    "accessed_at" : "2023-09-11T17:54:05Z",
    "languageGrammar" : "Markdown",
    "content" : ""
  },
  {
    "created_longitude" : -81.198412896953215,
    "modified_at" : "2023-09-11T19:26:39Z",
    "content" : "Let's just get a whiteboard and go through a list of each equation and be asked to explain what it is\/what each variable means, and then do a couple math problems with em. That should be more than enough.",
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "created_latitude" : 28.602610071627062,
    "modified_longitude" : -81.198447382431723,
    "accessed_at" : "2023-09-11T19:25:31Z",
    "flagged" : false,
    "modified_latitude" : 28.602637967417781,
    "created_at" : "2023-09-11T19:25:31Z",
    "uuid" : "FC4D9287-D2FE-4F3B-B7E4-E770A05C8868",
    "folder" : 0
  },
  {
    "uuid" : "061CCCE7-B443-4FF6-B633-0145F2B48B68",
    "created_at" : "2023-09-11T21:19:00Z",
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "modified_longitude" : -81.20075508028377,
    "created_longitude" : -81.20075508028377,
    "content" : "I wonder if that backwards stance I sometimes take when I longboard is called something. Reverse Goofy? Inverted?",
    "accessed_at" : "2023-09-11T21:19:00Z",
    "created_latitude" : 28.596884007592298,
    "modified_at" : "2023-09-11T21:19:41Z",
    "folder" : 0,
    "modified_latitude" : 28.596884007592298,
    "tags" : [

    ]
  },
  {
    "tags" : [

    ],
    "created_longitude" : -81.207467392162613,
    "accessed_at" : "2023-09-11T21:42:28Z",
    "created_at" : "2023-09-11T21:30:38Z",
    "folder" : 0,
    "modified_longitude" : -81.243548306234359,
    "flagged" : false,
    "created_latitude" : 28.597924285594928,
    "modified_latitude" : 28.598851988271534,
    "uuid" : "A860E3CE-9820-4D35-AC3D-0DA067ED26C8",
    "modified_at" : "2023-09-11T22:06:57Z",
    "languageGrammar" : "Markdown",
    "content" : "The movie franchise Saw messed up.\n\nSomeone making a movie or game or whatever artistic experience with the name similar\nto Saw should've taken the opportunity to spread the (Dawkins defined) meme where those who experienced it were for a time to be literally \"one\" with the art at some point. In that way, the artist could spread the idea that when speaking about it, one should really say \"I saw 6\" rather than \"I saw Saw 6\". \"Do you come want see 11 with us?\" Said like that, one could hijack the English language to create a unique bit of wordplay. This sad, lonely, probably chronically depressed Hollywood idea-man i.e. the artist in question, only requires a concept for an artist expression that would make such an attempt of proliferation reasonable, widely agreeable and to coherent to the public, and most challengingly, substantive in surrounding content. Sorry dude."
  },
  {
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "modified_latitude" : 28.599035358991582,
    "folder" : 0,
    "modified_longitude" : -81.243795176458917,
    "created_at" : "2023-09-11T21:35:58Z",
    "tags" : [

    ],
    "modified_at" : "2023-09-11T21:42:07Z",
    "created_longitude" : -81.243532458395919,
    "accessed_at" : "2023-09-11T21:40:37Z",
    "content" : "How music or all entertainment is to me now both a plugging valve that holds back or otherwise diverts my thoughts without distress, and also the source and fertilizer for those thoughts",
    "uuid" : "2A6084FF-A404-4B6C-B74E-DCD30A102F22",
    "created_latitude" : 28.598860795636288
  },
  {
    "created_longitude" : -81.221125384976986,
    "modified_latitude" : 28.613947461366934,
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "flagged" : false,
    "content" : "If wonder if bordering county construction workers have a code of honor type thing when deciding who has to maintain exactly what at the borderline. The ",
    "accessed_at" : "2023-09-11T22:48:54Z",
    "created_latitude" : 28.614319157449419,
    "tags" : [

    ],
    "modified_longitude" : -81.2264300193591,
    "uuid" : "A5D5C279-C7DA-4A2A-8906-33F17A2F1285",
    "created_at" : "2023-09-11T22:44:59Z",
    "modified_at" : "2023-09-11T22:50:15Z"
  },
  {
    "modified_at" : "2023-09-11T22:48:48Z",
    "accessed_at" : "2023-09-11T22:48:12Z",
    "tags" : [

    ],
    "created_at" : "2023-09-11T22:48:12Z",
    "folder" : 0,
    "created_latitude" : 28.613947461366934,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.2264300193591,
    "flagged" : false,
    "modified_longitude" : -81.2264300193591,
    "uuid" : "64253593-CCF8-434B-B81A-64A40A03FFAE",
    "content" : "How I am scared to think about how my brain used to be.",
    "modified_latitude" : 28.613947461366934
  },
  {
    "uuid" : "389EFD5A-3937-43A8-B18F-8DEC44742DD0",
    "created_latitude" : 28.597686784368562,
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.597267917120163,
    "modified_at" : "2023-09-11T22:53:05Z",
    "content" : "How one of the cards deep down is complex when removed will free me to speak to anyone and everyone",
    "created_at" : "2023-09-11T22:51:29Z",
    "accessed_at" : "2023-09-11T22:51:29Z",
    "folder" : 0,
    "flagged" : false,
    "modified_longitude" : -81.25396234889061,
    "tags" : [

    ],
    "created_longitude" : -81.244734842405876
  },
  {
    "created_longitude" : -81.25396234889061,
    "created_latitude" : 28.597267917120163,
    "content" : "AN APP THAT MAKES YOUR PHONE EMIT A PIERCING BLAST OF NOISE UNTIL YOUR PHONE IS CHARGING DURING A SET TIME. I NEED IT MADE YESTERDAY... BADLY!!",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "uuid" : "15332C90-6163-4885-AEED-0FCA5748F874",
    "modified_at" : "2023-09-11T22:56:42Z",
    "accessed_at" : "2023-09-11T22:53:29Z",
    "created_at" : "2023-09-11T22:53:29Z",
    "flagged" : false,
    "modified_latitude" : 28.597267917120163,
    "modified_longitude" : -81.25396234889061
  },
  {
    "modified_longitude" : -81.284600862314392,
    "tags" : [

    ],
    "content" : "Bonjour, I am the text that is here to say \"Hello, I wonder if I am visualized to you as some fragment on your screen on a graph, and if so am I at a peak? If so, I want to say \"Hooray!!\". If not, I ",
    "modified_at" : "2023-09-11T23:05:10Z",
    "uuid" : "48073448-A411-400B-ADFC-02C53E3C4AF8",
    "created_at" : "2023-09-11T23:00:26Z",
    "accessed_at" : "2023-09-11T23:00:26Z",
    "created_latitude" : 28.594838138568676,
    "created_longitude" : -81.284600862314392,
    "modified_latitude" : 28.594838138568676,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "folder" : 0
  },
  {
    "accessed_at" : "2023-09-12T02:34:41Z",
    "uuid" : "848DC750-EAF9-4420-AA54-007526033133",
    "content" : "My Halloween and Ren-fair costumes shall be the same this year. Double duty and double the quality of materials.",
    "created_at" : "2023-09-12T02:27:54Z",
    "created_longitude" : -81.284519306542492,
    "created_latitude" : 28.594461451809124,
    "tags" : [

    ],
    "modified_at" : "2023-09-12T02:34:48Z",
    "folder" : 0,
    "modified_latitude" : 28.594415379467527,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.284501842111553
  },
  {
    "created_longitude" : -81.284263332667464,
    "modified_longitude" : -81.284296356093321,
    "flagged" : false,
    "modified_at" : "2023-09-12T02:48:41Z",
    "content" : "Just had a literal brain blast as I was thinking about my costume for the renaissance fair. The convergence in the use of a well made medieval inspired outfit for both fairs and Halloween was satisfying enough. To then realize its flexibility could very easily extend to my D&D campaign in some fashion, as well as finally being a moment of progress in my character design for ZenBoarding. This is the time get a higher end specialty medieval outfit that will be the multitasker of the year. Alton Brown would surely be nothing be proud.",
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-09-12T02:40:59Z",
    "modified_latitude" : 28.594041214985303,
    "tags" : [

    ],
    "created_latitude" : 28.594002113459993,
    "uuid" : "1559365A-D0A8-47D0-BD20-6C1F51A781DB",
    "created_at" : "2023-09-12T02:40:59Z",
    "folder" : 0
  },
  {
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284486842306947,
    "uuid" : "C6833837-0E1B-464E-81AC-F931B9338628",
    "modified_latitude" : 28.594493532586309,
    "content" : "The further we get away from the exact moment in time that we record an current event for future reference, the more that date becomes just another obfuscated nebulous range of time in history. Expressing \"September 2019\" during that month, 1, 10, 100, or 1000 years later will almost certainly conjure different ideas and specifics. I see this, the expression of time into the human permanent archive to be like the planting of a waving flag across the path by which we march though the mountains of time. As we move forever forward, looking back only reveals the quickly shrinking flag; now a fadingly faint icon, occupying less and less of my vision until it joins the noise that comprises the uncertain fog we call the 'past'.",
    "tags" : [

    ],
    "modified_at" : "2023-09-12T05:12:41Z",
    "modified_longitude" : -81.284489044588028,
    "accessed_at" : "2023-09-12T04:42:23Z",
    "folder" : 0,
    "created_latitude" : 28.594497181956513,
    "created_at" : "2023-09-12T04:20:35Z",
    "flagged" : false
  },
  {
    "modified_at" : "2023-09-12T04:38:12Z",
    "content" : "I find myself recently using the iPhone auto suggestions in a fuuuuny way",
    "folder" : 0,
    "flagged" : false,
    "created_longitude" : -81.284486806606196,
    "accessed_at" : "2023-09-12T04:42:21Z",
    "created_at" : "2023-09-12T04:36:34Z",
    "languageGrammar" : "Markdown",
    "uuid" : "69D29D06-CAD4-45AC-A24F-12EFE292C393",
    "modified_latitude" : 28.594441185731995,
    "tags" : [

    ],
    "modified_longitude" : -81.284523401485089,
    "created_latitude" : 28.59449719197076
  },
  {
    "modified_latitude" : 28.594504791276897,
    "accessed_at" : "2023-09-12T05:12:41Z",
    "modified_at" : "2023-09-12T05:28:46Z",
    "tags" : [

    ],
    "created_latitude" : 28.594493532586309,
    "folder" : 0,
    "uuid" : "BB4DECC7-34A0-4FAB-A510-F22408FA1C90",
    "modified_longitude" : -81.284479869954097,
    "content" : "My writing is sure to drastically change when I begin to write these notes using an actual computer keyboard. As I am able to write 4-6 times using that then an iPhone touch keyboard, my stream of thoughts will come out smoother through ALL of my fingertips. Less interruptions having to wait for my two thumbs to catch up as my mind waxes on at rapid speed likely means better ideas and truer thoughts. It makes sense to strike while the irons hot, does it not? What doesn't make sense is that I still write this much and at this hour while using an awful phone is on out of date software, with memory that has been tortured through gigabytes of photos, powered by a battery that has been through worse than the literal torture they do for testing. I guess I feel mostly gratitude towards it?",
    "languageGrammar" : "Markdown",
    "created_at" : "2023-09-12T05:12:41Z",
    "flagged" : false,
    "created_longitude" : -81.284489044588028
  },
  {
    "folder" : 0,
    "flagged" : false,
    "created_latitude" : 28.594504791276897,
    "content" : "I hope I can visit lucid dreaming on my next stop of mental expansion. It's more clear than ever that such things are completely within my grasp, they really do just take a long while to see your rewards.\n\nHey me! Go dream big tonight! Find a way to know when you are seconds away from entering the optimal lucid dreaming state of REM, and to remind yourself hold on to some truth, maybe even a mental image or object to possess. Relate that idea to the deepest understanding that you are in a lucid dream at this very moment, and to stay calm and focus on your senses. Then, to further believe that the space I perceive to inhabit is not only imaginary, theoretical, and arguably useless, it is the space I cannot deny I sense myself deeply invested in. It's hard to deny the mountains of writing evidence to be found here.\n\nAnyways, try creating that association with a real or mental object and see if you can bring it into such a curious space. Good night.",
    "modified_latitude" : 28.594505647027912,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-09-12T05:28:49Z",
    "created_longitude" : -81.284479869954097,
    "modified_longitude" : -81.284480275871658,
    "tags" : [

    ],
    "uuid" : "157A9737-10A7-433B-A76B-6D31EB19176E",
    "modified_at" : "2023-09-12T05:45:55Z",
    "accessed_at" : "2023-09-12T05:28:49Z"
  },
  {
    "tags" : [

    ],
    "modified_latitude" : 28.594505642760524,
    "modified_longitude" : -81.284480265705582,
    "folder" : 0,
    "created_at" : "2023-09-12T05:49:48Z",
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594505642760524,
    "content" : "You're a toy in the Toy Story universe. You see Andy's mom setting up a yard sale. You want to hide as many toys away in a safe area, but the more that hide, the more likely she is notice the lack of toys in her collection and investigate more thoroughly. What do you do?",
    "modified_at" : "2023-09-12T05:52:47Z",
    "accessed_at" : "2023-09-12T05:49:48Z",
    "flagged" : false,
    "created_longitude" : -81.284480265705582,
    "uuid" : "B3F5EDD9-9F6F-4217-B9DD-BD9A4EA11544"
  },
  {
    "created_at" : "2023-09-12T06:12:35Z",
    "created_latitude" : 28.594511127770136,
    "folder" : 0,
    "modified_latitude" : 28.594509843843831,
    "accessed_at" : "2023-09-12T06:35:34Z",
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-09-12T09:06:49Z",
    "content" : "Toys in the Toy Story universe to me, become sentient when they either are taken out of their packaging for the first time, or some other conscious being knowingly and\/or unknowingly uses their perception of what the toy should act like for the first time. The latter explains situations like in the second movie, where the fake Buzz becomes sentient when the real one begins being aware of it for the first time. Timing the film, it takes about 40 seconds between first sight and fake Buzz fully sentient, or about 20 if you remove cuts to other characters and estimate unseen movement. This would also mean that this new Buzz was a brand new display model, and not only is not consistent with the universe timeline, or that no child or store worker or passerby of any age gave the breathe of life that is imagination to that poor toy. Another way these two theories give new context is the credits blooper scenes. If we think of these toys as sentient when another sentient creature perceives it or opens their box, one could see the bloopers as the footage taken by in-universe humans who have given the depicted toys the personality of actors and actresses of a film where toys are sentient beings... and so forth. Enough information such that they act exactly as desired to film what was envisioned. God knows what they become of  s physically or even mentally once all the tape is in the can. Speaking of God, it's seemingly godlike within this fictional Toy Story universe to be able to assign specific personalities to toys at a whim, and have them behave such that these video cameras or bodies are either totally imperceptible.",
    "uuid" : "4906DE92-CBC8-4819-93E1-0C3A80AA51D1",
    "tags" : [

    ],
    "created_longitude" : -81.284475204281293,
    "modified_longitude" : -81.284454063716012,
    "flagged" : false
  },
  {
    "created_at" : "2023-09-12T15:44:47Z",
    "folder" : 0,
    "uuid" : "1561ADAD-42F1-4549-A6E1-24857AF16903",
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.59013220972934,
    "modified_longitude" : -81.199034387643664,
    "modified_latitude" : 28.591413424161214,
    "created_longitude" : -81.198837961020075,
    "tags" : [

    ],
    "modified_at" : "2023-09-12T15:46:05Z",
    "flagged" : false,
    "content" : "Fascist creeps and the Fascist creep they ",
    "accessed_at" : "2023-09-12T15:44:47Z"
  },
  {
    "accessed_at" : "2023-09-12T17:04:45Z",
    "created_longitude" : -81.198837961020075,
    "tags" : [

    ],
    "uuid" : "7E91D9CD-5E44-4AC2-BBF9-CDC2CD92683F",
    "content" : "In so many areas of academia and beyond, I see the fruits of labors that once filled me with astonishment and reverence now seem plain, ordinary, and trivially understood. Scientific papers, and lectures, and that whole world of wisdom I observed externally... My eyes now only recognize the evident marks of a humans' hands. The wise world before me was not the realm of Gods and ultimate truth. It was hallowed lands above that was fated to come back down to Earth.\n\nIt was this transitory phase, sublimely liminal, that defines the Death of Apotheosis.",
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.198837961020075,
    "modified_latitude" : 28.59013220972934,
    "created_at" : "2023-09-12T17:04:45Z",
    "modified_at" : "2023-09-12T17:26:19Z",
    "folder" : 0,
    "flagged" : false,
    "created_latitude" : 28.59013220972934
  },
  {
    "modified_at" : "2023-09-13T01:06:43Z",
    "flagged" : false,
    "created_at" : "2023-09-12T21:54:05Z",
    "languageGrammar" : "Markdown",
    "content" : "The comforting triviality in discerning the difference between feeling the antsy, uneasy urge to make large, difficult-to-maintain changes in one's life, and instead understanding accepting such urges and the truth behind the need for change at all. It's comforting to see the evolution for sure, but it does also invite anxiety  when it comes to explaining this to others, as well as at least for me, achingly powerful waves of anxiety when I think about those who I love doomed to be forever impercipient.",
    "modified_longitude" : -81.199897381186346,
    "modified_latitude" : 28.606591255849281,
    "folder" : 0,
    "created_latitude" : 28.594518299451089,
    "created_longitude" : -81.284431796743377,
    "accessed_at" : "2023-09-13T00:54:53Z",
    "uuid" : "D54446C8-DEF1-4250-87CE-C3ABE5E05AAB",
    "tags" : [

    ]
  },
  {
    "tags" : [

    ],
    "flagged" : false,
    "uuid" : "F4654040-A8BD-4068-B5C2-E3CD507EB5E5",
    "modified_longitude" : -81.199894673767304,
    "accessed_at" : "2023-09-13T01:20:51Z",
    "content" : "The one thing I learned today is ",
    "modified_at" : "2023-09-13T01:21:35Z",
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.606595156121053,
    "folder" : 0,
    "created_longitude" : -81.199894673767304,
    "modified_latitude" : 28.606595156121053,
    "created_at" : "2023-09-13T01:20:51Z"
  },
  {
    "created_at" : "2023-09-13T01:35:42Z",
    "accessed_at" : "2023-09-13T02:15:12Z",
    "modified_latitude" : 28.606304560399781,
    "modified_at" : "2023-09-13T02:19:01Z",
    "content" : "I could probably pull an \"all-writer\", sitting where I am, in the relaxed and creative mood that I am, with the warm and comforting feelings that I feel, the breezy moonlit sky above me, and best of all... with a few of the physical objects that matter most to me right now by my side.\n\n\n...\n\n\n\n(In the (my) interest of archiving all that I can find agreeable at time of writing; I am currently sitting upon the top floor of concrete parking garage 'H' at UCF, nestled in a small corner on the side closer to the Student Union. My cheap vaporizer loaded with a smuggled illicit marijuana wax cartridge I slipped through on my way back from San Diego. \n\nNothing described above is bad or inferior, to be clear. It's simply a joy to capture it all so... succinctly. Like capturing a firefly in a bottle, perhaps it's fair to say I like collecting such curiosities. What does this curiosity tell us, I don't hear you not ask? Genuinely?",
    "modified_longitude" : -81.196831301830485,
    "uuid" : "9FDDFF46-8EE8-43B1-98EC-CE5D3CABA642",
    "created_latitude" : 28.606105439688516,
    "tags" : [

    ],
    "folder" : 0,
    "created_longitude" : -81.200207677625102,
    "flagged" : false,
    "languageGrammar" : "Markdown"
  },
  {
    "created_latitude" : 28.606304560399781,
    "accessed_at" : "2023-09-13T03:47:50Z",
    "folder" : 0,
    "modified_at" : "2023-09-13T03:48:55Z",
    "uuid" : "97D704E5-FE8B-4659-9291-DA17867966B5",
    "created_at" : "2023-09-13T02:19:20Z",
    "flagged" : false,
    "modified_latitude" : 28.599294245682074,
    "content" : "There are short intervals during the long periods of intense thinking or writing like I do here, where, when I get momentarily distracted by a passing thought or other point of interest, my mind or voice or fingers still strangely manages to be given the neural signals to express some amount of thought into the world. It's in some ways filler words my mind felt like actualizing before it ran out of metaphorical steam on the metaphorical train engine. It's a circumstance that I find very interesting to ponder over. I would love to work on a project about these insignificant... \"things\". Barely worthy of a name, this deplorable phenomenon that for me is the equivalent of a computer memory buffer that gets unexpectedly wiped clean. They live for a short time so that they may die, and die so they to be the last conceivable remnant of a line of thought lost for good. Their loathsome existence is genuinely pitiful, tragic and sad. Suffice it to say, my metaphorical train meets a quick and simple end, in the form of an ever encroaching brick wall of... truthfully, my current best definition is 'whatever the mental antonymic equivalent of ideation'. You'll have to rely on your own beliefs on the existence and degree of pain and suffering that bad boy of a brick wall will deal.",
    "modified_longitude" : -81.207792861462735,
    "created_longitude" : -81.196831301830485,
    "tags" : [

    ],
    "languageGrammar" : "Markdown"
  },
  {
    "accessed_at" : "2023-09-13T02:45:22Z",
    "tags" : [

    ],
    "modified_longitude" : -81.201309254622188,
    "modified_at" : "2023-09-13T02:54:17Z",
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "created_longitude" : -81.201083479142042,
    "created_latitude" : 28.602904862711011,
    "modified_latitude" : 28.604098032738289,
    "content" : "This is perfect. I just came back from a trip, halfway through which I received my fellowship grant money. It's nearly been a week since then, and I have lived life largely normally and comfortably. I have a therapist appointment on Friday, I've been spending money at an average rate, and no major bills are due to interfere. This is the optimal week to serve as control week for my budgeting needs. Provided I continue acting as I have been until Sunday morning, I should be able to get a good understanding of where I spend my money in week. As I currently have no continuous income flowing in, this plan ought to serve its purpose pretty well.",
    "uuid" : "FBE3C7DF-66E3-4071-86CC-A7F6227FFD13",
    "created_at" : "2023-09-13T02:45:22Z"
  },
  {
    "uuid" : "B0958CCA-D1B6-45A7-A33C-0E256EAA6E96",
    "created_at" : "2023-09-13T03:52:09Z",
    "created_latitude" : 28.568154949510379,
    "folder" : 0,
    "modified_longitude" : -81.278179965912102,
    "tags" : [

    ],
    "modified_latitude" : 28.568657560899371,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-09-13T04:02:00Z",
    "accessed_at" : "2023-09-13T04:11:01Z",
    "content" : "With when, where I'm\n\n\n",
    "created_longitude" : -81.207639105498416,
    "flagged" : false
  },
  {
    "modified_latitude" : 28.594830854593681,
    "content" : "Calling it now, a Reddit rabbit hole will be known as a 'Rebbit'.",
    "uuid" : "8F758EB9-3E70-47AB-A213-10C64EBF3343",
    "tags" : [

    ],
    "modified_longitude" : -81.285233035785609,
    "created_longitude" : -81.285233035785609,
    "accessed_at" : "2023-09-13T04:56:13Z",
    "created_latitude" : 28.594830854593681,
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-09-13T04:57:07Z",
    "flagged" : false,
    "created_at" : "2023-09-13T04:56:13Z"
  },
  {
    "uuid" : "BFA34B6D-A13D-486A-9A58-5413DBEEB822",
    "modified_longitude" : -81.284431796743377,
    "accessed_at" : "2023-09-13T05:13:45Z",
    "created_longitude" : -81.284431796743377,
    "folder" : 0,
    "modified_at" : "2023-09-13T05:14:16Z",
    "tags" : [

    ],
    "created_latitude" : 28.594518299451089,
    "flagged" : false,
    "created_at" : "2023-09-13T05:06:20Z",
    "modified_latitude" : 28.594518299451089,
    "content" : "Top tier MacBook (M2-Ultra): ~$1800\nMid tier (M2): ~$1000\nBottom barrel tier (M1): ~$800",
    "languageGrammar" : "Markdown"
  },
  {
    "uuid" : "58F7A178-A429-4C96-8BCE-12E10DD16ACF",
    "modified_at" : "2023-09-13T05:30:22Z",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "content" : "It finally feels fair to say it.\n\nSome or all of me can sometimes feel what I can only say are \"growing pains\". In what sense, I genuinely struggle to explain. But what I feel is aligned acceptably enough with my true perception is that it is a pain not localized anywhere within my body. It somehow aches in another manner, more incorporeal than incarnate. I hesitate to write some thoughts down, as I feel paralyzingly conflicted between my objectives in writing my ",
    "folder" : 0,
    "created_longitude" : -81.284431796743377,
    "modified_longitude" : -81.285231362260802,
    "flagged" : false,
    "modified_latitude" : 28.59483073192245,
    "accessed_at" : "2023-09-13T07:00:12Z",
    "created_at" : "2023-09-13T05:14:20Z",
    "created_latitude" : 28.594518299451089
  },
  {
    "uuid" : "1CF54DF4-A3DA-494C-9DC9-69BBCCE9C40E",
    "folder" : 0,
    "content" : "Why can't we just make and distribute code that auto replaces any awful default social media UI to one that you prefer to use. It's all local files, purely visual changes, and no money or copyrighted material needs to be exchanged. All the same information and features can be guaranteed to be present. Is it because no one's thought of it? Is it because interfaces and their names or content change so frequently? Or maybe it's because they don't want to give anyone an inch? Because allowing these programs to be widely disseminated could reduce advertisement efficiency? And because they don't want us to be granted even a single piece to our side of the board; they much prefer the whole lot to themselves?",
    "modified_longitude" : -81.284431796743377,
    "tags" : [

    ],
    "accessed_at" : "2023-09-13T06:37:17Z",
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284471433685425,
    "modified_latitude" : 28.594518299451089,
    "created_at" : "2023-09-13T06:37:17Z",
    "modified_at" : "2023-09-13T06:59:43Z",
    "flagged" : false,
    "created_latitude" : 28.594503253725026
  },
  {
    "modified_latitude" : 28.594525613649523,
    "tags" : [

    ],
    "uuid" : "DE35E86F-1BDF-44C4-9CDF-8459EC99BD64",
    "created_latitude" : 28.594526148885905,
    "flagged" : false,
    "created_at" : "2023-09-13T14:13:01Z",
    "modified_longitude" : -81.284432481554916,
    "created_longitude" : -81.284433269124435,
    "modified_at" : "2023-09-13T14:21:57Z",
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-09-13T14:23:59Z",
    "content" : "...And so too.... did the mind of the voyager....  began to pour over.... something with a faucet or spigot?...\n\nThese words have been hanging around my mind for the past couple days and I suppose that's something worth noting. I actually get the sense there is some larger concept that is trying to get out, but for now is just some idea relating to those words in about that order. Like I mentioned, it is unusual that I feel this strongly about this sort of concept or expression for so long.",
    "folder" : 0
  },
  {
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284432599456565,
    "folder" : 0,
    "modified_latitude" : 28.594526129699673,
    "uuid" : "749B01D9-9529-4B7D-8DB5-7144D04755DA",
    "accessed_at" : "2023-09-13T14:24:01Z",
    "modified_at" : "2023-09-13T14:27:59Z",
    "created_latitude" : 28.594525456103192,
    "created_at" : "2023-09-13T14:24:01Z",
    "flagged" : false,
    "modified_longitude" : -81.284433225330233,
    "content" : "BACK SUPPORT BACK SUPPORT BACK SUPPORT.\n\nBUY BACK SUPPORT FOR ALL THE PLACES THAT CAUSE YOU PAIN, INCLUDING\n\nMY PERSONAL DESK CHAIR\nMY USED-TO-BE-A-PIANO-BUT-NOW-IS-MY-BATHROOM-STOOL STOOL\nMY CAR (though I genuinely cross my fingers that my new one will be perfect :) )\nMOST OF ALL: WALKING ANY UPRIGHT POSITION... FIX POSTURE SOON.\n"
  },
  {
    "created_longitude" : -81.284433301557101,
    "accessed_at" : "2023-09-13T17:40:33Z",
    "created_latitude" : 28.594526163266206,
    "modified_longitude" : -81.284433276969082,
    "tags" : [

    ],
    "content" : "An internal internet password system that relies on a key based on some aspect of the site I am visiting. An example I am totally not considering using is incorporating a historical, fictional, or otherwise metaphorically oft associated assembly of concepts. Like say, an organization, where each member embodies a concept or idea. The nerdy smart guy can be used in the password for your banks, the foodie for restaurant and fast food apps, and so on. The creepy scientist character that no one likes for your porn accounts. I digress.",
    "flagged" : false,
    "modified_latitude" : 28.594526365960274,
    "languageGrammar" : "Markdown",
    "uuid" : "4418D849-AD72-4D47-91D6-34DAA2FF76E7",
    "modified_at" : "2023-09-13T17:45:15Z",
    "folder" : 0,
    "created_at" : "2023-09-13T15:01:42Z"
  },
  {
    "uuid" : "229BEFBA-397F-474F-B12A-7BAB09CE839B",
    "modified_latitude" : 28.594526275720042,
    "modified_longitude" : -81.284433555179717,
    "created_at" : "2023-09-13T18:23:06Z",
    "created_longitude" : -81.284433555180954,
    "tags" : [

    ],
    "created_latitude" : 28.594526275719463,
    "folder" : 0,
    "modified_at" : "2023-09-13T18:26:39Z",
    "languageGrammar" : "Markdown",
    "content" : "I've been that good kind of forgetfulness lately. The kind of trance you fall into a dream ",
    "flagged" : false,
    "accessed_at" : "2023-09-13T18:23:06Z"
  },
  {
    "modified_latitude" : 28.594526275720042,
    "flagged" : false,
    "accessed_at" : "2023-09-13T18:26:50Z",
    "created_at" : "2023-09-13T18:26:50Z",
    "created_latitude" : 28.594526275720042,
    "modified_at" : "2023-09-13T18:28:40Z",
    "created_longitude" : -81.284433555179717,
    "modified_longitude" : -81.284433555179717,
    "uuid" : "4AB8A6B9-B913-4E48-8542-5E7AA3B6EE45",
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "tags" : [

    ],
    "content" : "There is so much I can think of that I am just at the edge of complete commitment at this moment, this second. I "
  },
  {
    "flagged" : false,
    "created_longitude" : -81.285086928231323,
    "modified_at" : "2023-09-13T18:56:47Z",
    "created_at" : "2023-09-13T18:51:11Z",
    "content" : "Perhaps my mind stands broken and defeated yadda keep it going.\n\nAlso a point about mind broken before brain for my feelings towards myself and the Law of Large Numbers and dating and finding a deep connection",
    "accessed_at" : "2023-12-19T01:30:43Z",
    "folder" : 0,
    "modified_longitude" : -81.228138758536474,
    "modified_latitude" : 28.597728569041855,
    "tags" : [

    ],
    "uuid" : "514AA401-D06D-4B88-9FBE-B288B2DC3427",
    "created_latitude" : 28.597350786329574,
    "languageGrammar" : "Markdown"
  },
  {
    "modified_longitude" : -81.201767433340322,
    "folder" : 0,
    "accessed_at" : "2023-09-13T18:56:49Z",
    "tags" : [

    ],
    "flagged" : false,
    "created_latitude" : 28.597728569041855,
    "modified_at" : "2023-09-13T19:02:11Z",
    "content" : "What's convenient about the brain is that if i can't find the time to write down a thought, my frustration, concentration, and often gameification of during a long enough interval can mean that even if I do forget ",
    "created_longitude" : -81.228138758536474,
    "created_at" : "2023-09-13T18:56:49Z",
    "uuid" : "8DE024AF-7F6A-485D-B4A6-DB11A79887F1",
    "modified_latitude" : 28.598802936534657,
    "languageGrammar" : "Markdown"
  },
  {
    "modified_longitude" : -81.199211041153589,
    "modified_latitude" : 28.594096685386834,
    "created_longitude" : -81.199211041153589,
    "modified_at" : "2023-09-13T19:05:37Z",
    "content" : "There will always be girls that ",
    "folder" : 0,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594096685386834,
    "uuid" : "D55D1704-1148-454D-BDA3-83CFF6CCE31E",
    "flagged" : false,
    "created_at" : "2023-09-13T19:05:14Z",
    "accessed_at" : "2023-09-13T19:05:14Z"
  },
  {
    "content" : "Reddit was about to have me sprint on here to give my live thoughts after I happen to glance at the app and see \"NON-HUMAN ALIEN BODY DISPLAYED IN MEXICO'S CONGRESS\" on all channels. What a roller coaster of a ride the last few minutes were, mamma mia. I was actually planning on running to nearest public space and yell \"ALIENS HAVE BEEN SCIENTIFICALLY CONFIRMED REAL, THIS IS NOT A PRANK TAKE A LOOK OR OPEN REDDIT YOURSELF\" or something to that effect. I would be nothing but pleased to be notified immediately personally. Too bad I read a little more and discovered its highly suspicious details, particularly its finders past. Ah well.",
    "modified_at" : "2023-09-13T19:16:32Z",
    "folder" : 0,
    "uuid" : "286D45A1-FDA7-4928-A54F-76FC599E3C70",
    "created_latitude" : 28.594164740738439,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.594070248018625,
    "modified_longitude" : -81.199233973624771,
    "created_at" : "2023-09-13T19:08:23Z",
    "accessed_at" : "2023-09-13T19:08:23Z",
    "tags" : [

    ],
    "created_longitude" : -81.199250268867218
  },
  {
    "flagged" : false,
    "uuid" : "FC3B9105-0C1B-461B-920E-7516F5981863",
    "content" : "Fuck it, I'm walking to class right now, long walk in the rain ahead of me. I decided to park far as to avoid garage C's traffic, only to arrive as it began to drizzle. \n\nShould I proclaim to these people, those who right now are feeling cold, distant, eyes squinting  we",
    "tags" : [

    ],
    "created_at" : "2023-09-13T19:22:32Z",
    "created_latitude" : 28.597400037333905,
    "modified_longitude" : -81.199816265645481,
    "modified_latitude" : 28.598933451518391,
    "created_longitude" : -81.200807275605385,
    "modified_at" : "2023-09-13T19:27:31Z",
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-09-13T19:22:32Z",
    "folder" : 0
  },
  {
    "flagged" : false,
    "uuid" : "52F12CE0-982F-47DC-8836-6145928067DE",
    "modified_at" : "2023-09-13T20:02:32Z",
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.199540637377893,
    "content" : "The whole tangent about how my mind, without ",
    "accessed_at" : "2023-09-13T20:01:39Z",
    "created_at" : "2023-09-13T20:01:39Z",
    "tags" : [

    ],
    "created_longitude" : -81.199540637377893,
    "modified_latitude" : 28.593974330188139,
    "created_latitude" : 28.593974330188139,
    "folder" : 0
  },
  {
    "folder" : 0,
    "modified_at" : "2023-09-13T20:10:12Z",
    "modified_longitude" : -81.199501610061461,
    "modified_latitude" : 28.593921880743107,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-09-13T20:10:07Z",
    "content" : "Sex timer!!",
    "flagged" : false,
    "accessed_at" : "2023-09-13T20:10:07Z",
    "created_latitude" : 28.593921880743107,
    "created_longitude" : -81.199501610061461,
    "uuid" : "BF08018D-534E-4BCB-BB85-019EFC8A35F8",
    "tags" : [

    ]
  },
  {
    "created_longitude" : -81.1999436065136,
    "uuid" : "9FD9BF07-1B3A-4DF3-AD51-F379C7DAC626",
    "flagged" : false,
    "modified_latitude" : 28.597087965191022,
    "created_at" : "2023-09-13T20:13:36Z",
    "modified_at" : "2023-09-13T20:14:28Z",
    "accessed_at" : "2023-09-13T20:13:36Z",
    "created_latitude" : 28.597087965191022,
    "content" : "I'm leaving that last one in for, I guess I should say, ",
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "tags" : [

    ],
    "modified_longitude" : -81.1999436065136
  },
  {
    "folder" : 0,
    "uuid" : "254015F8-C562-4CAB-9F7E-2ED8895156FB",
    "modified_longitude" : -81.20049959987513,
    "tags" : [

    ],
    "modified_at" : "2023-09-26T23:12:11Z",
    "flagged" : false,
    "created_longitude" : -81.19982426993657,
    "content" : "That song, \"I always feel like, somebodies watching me\" but like not as funny or literal or consistent... or gradually unfunny.\n\nI might actually need a notepad for my notepad. Some other app to put even smaller starter notes, just enough information to reilluminate that neural pathway for me to catch back on to the context and stakes, players and rules, or at least the general direction of thought I desired to venture into. This page may serve as such until then...\n\nI think I got it. The logic of my mental health progress could be described as a moving from frequent thoughts of stress, trauma, existential despair, anxiety, and of course depression, towards frequents thoughts of understanding of myself, the mind, and what many concepts I've never deeply considered truly are.\n\nThe chain of awaiting thoughts that I've held in my head, has been impressive to even myself. Bouncing from app to app\n\nDon't write too little though on that note note app, like just \"doing it again\". Cause sure, right now the context is in there, in warm and freshly used\n\nLoci of location\n\nWhile I contest to being no stranger to the months or even year long drastic personality shifts, the one that I take issue with even referring to as a \"personality\" and \"shift\"\n\nMy brain can be quite foul, rotten, often even overly inflammatory and unambiguously racist, antisemitic, and every other -ist I know--and it almost always is related to others. What's the strangest thing to me is that, I don't feel a single iota of hate or negativity toward any person or group or anything like that. The closest things I can say I \"hate\" are corporations, capitalism, and convicts??? Look that one up\n\nFeeling the physical effects of a mental backlog that captures a tiny portion of the spiritual vwithin me. It is the dance and song that has all but sequestered me to move \n\nIs that step on the awful and current \n\nI like just being outside*\n\n*keep it going**\n\n\nJust passed by a giant black Escalade with a equally giant tough looking guy \n\nNeed one of those things grocery employees use on their lap as they walk around quickly typing in data and things and stock. That or stenographer thingy \n\nFeeling a vague sense of something when I ponder on the flow of some kind of central spiritual(?) entity from which all human or sentient life is defined as a vessel terminating \n\nI see how the chanbelong  of a state of mind towards finding it interesting and captivating to write could quickly divinely ordained and \n\nHow losing a thought to the ether feels painful and like the familiar sting of attachment, but there's no victim or perpetrator. A victimless crime, how loony is that?!\n\nIs there a grammatical difference between a sentence ending with \"?!\" and \"!?\"?! If so, why was one was chosen? If not, is that not a perfect study \n\nThis style and medium of writing that I've been doing, is it a known style? Not just stream of consciousness, but the combination of a frequent influence of drugs, as off-the-cuff, the record, the mark.. keep goin\n\nIt is with either horror or reverence that announce that I have no choice but to make a folder of writing solely about all the meta and emergent epiphanies and satisfying connections related to writing I've been having. They spill out! It must be because of my huge spike in the art taking up my time and my mind. Writing in this way, or much out at all outside the occasional URL or line of code, is certainly \n\nConsidering the (to me) very real possibility that I am in the process of understanding \n\nThis so called \"note note\", here's some features I need in my life: a way to near instantly and effortlessly switch between any number of different notes with no hassle. The would have to be called \"Threads\" and at the very worst, needs to take only 1 physical action by the user to switch off of the current thread AND pull up the desired one AND ensures the iPhone keyboard stays up AND keyboard or other \n\nCan one person exhibit multiple personalities or other complex mental disorders\n\nThe way I write these some times (usually when high) is so strange. One moment I'm in a burst of creative ideation, jotting down 10 up to even 50 words with near perfect focus, vocabulary, syntax, grammar, and even more complex literary yadda yadda (perhaps aided by the positive effects of THC and(?)\/or(?) CBD that enable longer more complex chains of thought to be y, the right mental and environmental conditions ...). Like a combination lock, each word in a sentence sequentially yadda.. like those AI visualizations showing a sentence being constructed with the next word quickly flashing until it finds its choice, neural net pathways firing in the background.\n\n.\n. Seconds or minutes or hours or days later I will find myself picking up that thought from unexpected places, random ads or yadda. \n.\n. Sometimes when a thought takes too long to come out how I am happy, and it takes hours to considered acceptable enough to be admitted as thought.\n.\n. A Short and Incomplete List of the many ways I have perceived my writings to be affected or otherwise influenced by the method\/medium of writing, input, apps, my mood, current drug influences, location and context of writing, recently interacted with people (i.e. friends my family, positive energy folk, etc.), content (i.e. the entertainment I've experienced, both old and especially currently), places, concepts or anything in between. As long as it has to capacity to act a trigger with my mind, as well as a pointer to some ddd. The random funny voice line of a Twitch\/YouTuber that springs up from my subconscious by coincidence or itself from just random. Said voice or totally long forgotten reference to something in a kids book you can't remember, but in which a like happened to jump out at use and so you incorporate it without much consideration as is the sake of the project. I dunno, I know that many writers are lifetime ticket holders for a seat to the theater of their mind. It is their job to seek, contend with, and digest something about the world. yadda yadda. The stylization and syntax of my writing, something very heavily influenced by yadda (my friends I think?) yadda\nThe frequency, logic and occurrence of when the order I process a section of thought necessitates that I write some ending phrase yadda\nHow I have the ability to sort of hammer in and \n.\n. (Make new note page defending above plz)\n.\n\nThe balance i find myself dealing with in this page, writing enough to feel confident some future me will get it, but not too much as recently, if I am writing here it means I likely writing a lot. Therefore, too much time on one thought often creates havoc for the likely many thoughts still line to be externalized. Each second is another opportunity for some distracting tangent or supplemental information to rip me on some journey that might be fun, but definitely sometimes leaves a lot of sad thoughts without a body to take. Now that I write this, I sense a goldmine of potential afoot. I've recently been writing a hardly noticeable amount on thoughts, their birth, mode of existence, death, and unknowingly a fourth thing \n\nBelow here is a fragment of thought. After I wrote the previous sentence, \n------------------------------------\nToday, this\n\n\nMy biggest interruptor of my writing is truly my bladder.\n\nI realized pleasingly late (literally and figuratively, it's 2am tho) that it is not interesting to me anymore that today in particular, I interacted with so many people in ways I never thought I've \n\nI'm a thought thot. Ttttttt \n\nI never thought I'd live to see the day I'd be the holder of so many proverbial ties to this Earth. I can feel myself surrounded by the invisible lines of fate \n\nList of suspect particular events\/drugs in my life that could been one or more of the reasons for my recent changes. Options include:\n\nInvestigate the timings it takes on average for me to be struck by a tangential thought, to decide as to deviate from \n\nThis amount of writing may seem scary or ill, but it's just what I think on a plate.\n\nI may be a little crazy but I might have intuited that we humans have a sort of single call and return system that helps us perform some amount of multitasking.\n\nI need to take a whole page to describe my boosh spoosh whatever stoners call it, my \n\nThe deliriously dehydrated lapping-water-dog I am in the moments of explosive literary harmony. The steel chain around its neck never failing to snatch the restless animal back away from the source of pure bliss for only long enough to despair after its taste but not sustain anything thing. \n\nI simply cannot forget to record the story of me pissing my pants twice in one day, the second time as I was turning the key to unlock my front door. I think all humans can equally agree, that is one notion that ought turn to avoid the fate of dissipating into the void. Nay, the piss thread, they collectively(?) turn to and speak towards one who ought to survive.\n\nDare I say, after watching and pondering on Casey Anthony \n\nI think I have must enforce a time, word, or other clever method of limited expression of thought for that note note app, \n\nSEX TOY TIMER APP CONCEPT I FORGOT WHERE ITS WRITTEN BUT ITS NOT GETTING AWAY THIS TIME. APP WITH HIGHLY PROGRAMMABLE TIMER AMOUNT\n\nI must now deliver a final ultimatum. I cannot leave this block of concrete on which I stand unless I cease all compulsive writing on this page and iPhone as a whole. After, I must then immediately move to get home as safely and swiftly as possible. In return, I'll move to take the photos of area to immortalize this pledge. I personally tend hardly tend to think of such trades as fair. Or was it fairly hard?\n\nAaaand stop!!! Well, for one thing,  it's feeling good to know a project was just ticked done in my mind. Well, technically its not done as I must commit to finishing the following conclusion:\n\nAs of writing, it is exactly 4:00am on September 14, 2023 ((more correctly, and only for this sentence, this short update was actually written 7:12pm September 26th. This distinction from the notes last modified date reads it to be is for many reasons, ranging from missing the minute interval of time to truthfully type the clock readout as the sharp number that it is and blaming my fingers and this keyboard yet again, to something that clicked within me as I was writing to compel me to insert the short intro above, and something you'll understand soon ;) (Also, did I just add in some forewarning in what is supposed to a be a pure transcription of my mental faculties to its most authentic expression and as to the best of my ability? Yes, that's what exactly what I did ;})).\n\nAs I love and cherish live and real-time recordings, I suppose there is no better time to take a few hours to record every detail I can think to include for truthfully arbitrary reasons. I guess the simplest way I see it, the reason why I, a doctoral student who researches the mind through the medium of Virtual Reality, someone who once was only driven by delusions of becoming some idealized Paragon of values\nI regarded as \"Intelligence\" and \"Purity\", now exists as he does. A tired, unshaven, man with hair unkempt is an arguable amount of consistency; the pastel yellow shirt and pink beach shorts, finished with bathroom slippers should cement your impression.\n\nThe intention of this writing was a lot of things over the course of around 24 hours. It began as a quick idea bank to write even shorter length bits of inspiration. Each note being\ngiving its own Drafts page is fine, but as described above it can be too cumbersome for my styling of writing. Over time, it became a honestly fascinating mix of ideas for this note note app, struggles and workarounds of using this app to efficiently express what I want, s d how this tiny note app could help. As night came as well as the idea of me considering this page as some sort of cohesive whole that could work as a form of artistic expression of my own, it drifted towards a more narrative style of thinking. I right now, feel that is it likely because of the looming realization of a timer being added as an recurring mental context in my usual patterns. I also feel like it is difficult to measure to number of \"interesting\" thoughts that I felt I recorded compared to the number lost for any number of reasons, or the number that right now I could remember all the necessary context needed to finish the draft, I honestly couldn't give you a definitive answer. A 1 minute scan of the writings will tell me that a rough ballpark estimate for each: 30 \"interesting\" thoughts written here in 24ish hrs. 50%-60% of all said desired thoughts that were synthesized and found to be worthy be written here specifically were lost and forgotten, in my best estimation. Finally, I feel that at least as I stand, or now sit, on this square slab that is the end of the sidewalk a few feet by a mailbox, that around 75%-85% of the above individual ideas are still fresh enough in my mind as to trigger the specific state of mind that I was in when I conceived and subsequently wrote down that particular concept.\n\nPhysically, I feel okay, feet hurt from sitting and standing. Feeling very exposed in all of my senses in an never ending assorting of ways. Weird frog croak groans, constant mosquitoes, and now a downright psychotic commitment to not move from this tiny 4 foot square public road space.\n\nMentally, I feel undoubtedly very tired. 24hrs plus a powerful CBD dab cart plus aggressive writing goals equals even more focus issues. Nothing outside of the ordinary, just usual confusion, difficulty thinking straight, slow breathing, and shambling walk that is fairly normal when I become this tired mentally or physically.\n\nSpiritually, I can sadly only say I'd much rather speak on in brighter circumstances:)\n\nI shall now end with some photos and videos of the place I stand as further proof of my conviction, and to keep to a promise above. But I really must sleep. The Sun is peaking though at the horizon now. Automatic parking lot lights have long been activated. A rooster nearby crowed at least 5 or 6 times at least 40 minutes ago. It's time I rest. \n\nI shall attach the photos and\/(or) I create and feel fit well somewhere to this text, and update the final writing time at the start of conclusion text (this was that last reason I wrote about, I knew I had to readjust the written time above {:-)) I can't help but also add there was an incredible star system that I've never seen before, a bit to to right of the triple vertical formation. Can't place it, but it was an beautiful transient companion on this project, and very well appreciated. \n\nhttps:\/\/imgur.com\/a\/2W4dtPu\n\nIn ending what this all has become, as I shakily stand, basked in the light of the new dawn, the encroachment a celestial marker that greets my addled yet unconquered selves, and up against the culmination of this long day of divulgence, a remarkably simple first attempt at a nebulous artistic vision I vehemently subscribe to... I leave within me a silence. The tranquil lull that\nto me, could always be attributed to a pacified and satisfied mind. It is perhaps the rays and gold and infatuation in above where I must walk home that that compel me to grasp this silence, and shatter it with a scream that I hope resonates eternally though all that has known this stellar radiance--Good Night, Good Morning, and Good Bye!",
    "created_latitude" : 28.597106672850092,
    "modified_latitude" : 28.604820705976898,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-09-13T20:18:58Z",
    "accessed_at" : "2023-12-26T01:27:07Z"
  },
  {
    "content" : "https:\/\/t.snapchat.com\/df5xToy5",
    "tags" : [

    ],
    "uuid" : "A26B3595-904C-46DA-B8FC-7ADCB3D1B741",
    "created_at" : "2023-09-13T21:01:50Z",
    "flagged" : false,
    "created_longitude" : -81.196514085760541,
    "modified_at" : "2023-09-13T21:01:50Z",
    "accessed_at" : "2023-09-17T22:43:51Z",
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.608886960218218,
    "folder" : 0,
    "created_latitude" : 28.608886960218218,
    "modified_longitude" : -81.196514085760541
  },
  {
    "content" : "Very soon after that last \"note\" I made here, I made a commitment to myself that I would take a break writing here. It was a test, at the time I could feel a sort of proto-addiction forming, a rush I could chase from putting my full being into writing. And so, to challenge myself yet again, I decided not to write for a few days. What I didn't know that it would end up continuing for nearly 3 weeks. After about three days, I started to experience some new phenomena due to this self imposed ban, and so I felt all but compelled to push this new mental and physical into its maximum potential.\n\nThe most significant thing I noticed was that roughly 12-40 times a day, when I would hear a phrase or watch a video or ponder over something, that familiar strike of inspiration would ring through me. As was my initial instinct, I would begin to go write this abstract bit of thought with genuine conviction, but soon (~2-5 seconds later, in my estimation) I would again realize I forbade myself, leaving me with three options:\n\n1) Reason with both the concept and myself, in hopes that I can tie it into one of my folders in my Obsidian Vault. This sometimes would lead to a thorough mental walkthrough of every topic I had written about that I could remember, combining and compositing two separate ideas into one. It forced me to consider some notions I had thought interesting were actually fairly mundane, others were unexpectedly and surprisingly associated with other topics and leading to even more excitedly rushed writing, or that the idea was considerably more profound than I once grasped.\n2) If the thought has musical or lyrical potential, try to morph the interesting internal impression into a poetic external expression. My other app, RhymersBlock, and a Page in Obsidian, allowed me to still write my thoughts despite the autobahn... I mean ban. The obviously musical ones were simple to write when I could, but some thoughts I felt strongly were more for the Drafts app style of notes, but were still crucially lyrical. And so, just as above, I had to make considerable conscious effort to change the concept into something that gave the same mental experience as before (or at least was enough to jog my memory of the experience) but now in meter, rhyme, and rhythm.\n3) Accept the thought for what it is, a passing friend that enjoys sharing some energizing insight before turning back to wherever it came.\n\nI of course, began the first few days of this psychological challenge of mine in varying levels of mental anguish. It never came close to crippling, but as my attention is often ripped away mid-thought, the everyday interruptions of life all but coerced me to routinely elect option 3. I didn't exactly see it as what is written above at the time, but I had no choice but to abandon some very engrossing leads. Over time though, I began to notice that some of those thoughts were springing back to the surface again, usually in a different form or developed in some way. It was as if the discarded thoughts returned to be mulled over in the deepest crevices of my mind. When the time was right, they reemerged, forcing they way out into the open mental space. Sometimes the alterations were strokes or ingenuity, others not nearly as much. Not all thoughts survived this trek, however. It's impossible to say, but perhaps only 10-30% of the thoughts I once deemed compelling enough to transcribe but was unable to were then reintroduced hours, days, or weeks later in sort form. There were certain thoughts that went through this process 3 or 4 times, each time I happen to recall the thought, and each time I became increasingly frustrated at my inability (or lack of desire) to write the idea down before it vanished for good.\n\nIt was perhaps 4 or 6 days after dealing with this struggle that I came to find a resolution. Empowered by the evidence that many thoughts will return with time, and some deep internal pontificating to understand my intentions in my writing as generally me as a being, I came to let go the stress that came with releasing those wild thoughts back below that surface. Barring some telepathic machine that would let me transcribe my thoughts effortlessly, it is a simple fact that I cannot give every thought a second… well… thought. When writing one idea leaves me with 5, a line must be drawn, no matter how striking in beauty and stinging in loss.\n\nBeyond any doubt, I certainly had much more to say, but as we know, those words happen to be out right now. They also don’t like to leave a note when they’ll come back, which is just brilliant.",
    "languageGrammar" : "Markdown",
    "uuid" : "6F10549E-757A-4273-A878-CC648E1EDB15",
    "tags" : [

    ],
    "flagged" : false,
    "accessed_at" : "2023-10-04T22:46:01Z",
    "modified_longitude" : -81.3901104972241,
    "created_at" : "2023-09-26T23:12:20Z",
    "folder" : 0,
    "modified_at" : "2023-10-04T22:48:20Z",
    "created_longitude" : -81.20049959987513,
    "created_latitude" : 28.604820705976898,
    "modified_latitude" : 28.802109916922795
  },
  {
    "folder" : 0,
    "modified_at" : "2023-10-04T22:48:42Z",
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.802109916922795,
    "created_longitude" : -81.3901104972241,
    "flagged" : false,
    "created_latitude" : 28.802109916922795,
    "modified_longitude" : -81.3901104972241,
    "uuid" : "7CB37368-2BDA-46C3-906F-045CB2CDB164",
    "content" : "If I had to guess the amount of time per day I am \"not in my body\" it'd be scary.",
    "created_at" : "2023-10-04T22:48:25Z",
    "accessed_at" : "2023-10-09T02:38:30Z",
    "tags" : [

    ]
  },
  {
    "created_latitude" : 28.594616603559562,
    "created_at" : "2023-10-09T02:38:36Z",
    "uuid" : "00244822-EAEF-48C0-BE3F-142F68453E55",
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "folder" : 0,
    "modified_latitude" : 28.590120302607581,
    "modified_at" : "2023-10-09T17:30:56Z",
    "created_longitude" : -81.284543011037954,
    "accessed_at" : "2023-10-09T17:24:09Z",
    "content" : "I wonder if you could make a racing video game where the challenge comes from beating yourself. This could be done with race ghosts that appear after every lap and follow your lead, requiring you to have to best their time. More laps = more threats on the track. \n\nI would like no opposition present other than the players' past, no future grievance resulting from the present without, and no plan of action complete passing total regard for the future.",
    "flagged" : false,
    "modified_longitude" : -81.198788383084036
  },
  {
    "modified_at" : "2023-10-09T04:05:41Z",
    "created_at" : "2023-10-09T04:05:02Z",
    "flagged" : false,
    "modified_latitude" : 28.594516217821035,
    "created_latitude" : 28.594516217821035,
    "accessed_at" : "2023-10-09T17:24:07Z",
    "uuid" : "C59B6D5D-2619-4441-902E-DF8F0D241042",
    "created_longitude" : -81.284440139030181,
    "tags" : [

    ],
    "modified_longitude" : -81.284440139030181,
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "content" : "Midjourney but the commas are moved forward by one word in the phrase and regenerated. "
  },
  {
    "modified_longitude" : -81.284441228611982,
    "modified_at" : "2023-10-10T02:33:23Z",
    "uuid" : "53FDDE47-D4CE-4E5B-9299-B015EBA5A56A",
    "tags" : [

    ],
    "modified_latitude" : 28.594516313024954,
    "content" : "I think a lot of the sadness I feel really is sidelined grief.  \n  \nI know the name of this scent that passes me by. I see the form it takes as it hangs over my days. It was a sense I had chased, and had been chased by. All my life, wanting and chasing. Ringing, wanting to know the name of the one who started the ringing in my thoughts. It's when those nights away from the noise and the bitterness landing on the buds of my cornea that I feel it in its greatest enveloping radiance.",
    "accessed_at" : "2023-12-19T01:30:45Z",
    "created_at" : "2023-10-10T02:33:20Z",
    "folder" : 0,
    "created_longitude" : -81.284441228611982,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594516313024954
  },
  {
    "folder" : 0,
    "modified_longitude" : -81.284441228611982,
    "uuid" : "0ED986DA-BE4D-4F82-9307-B1A4E8AA0F57",
    "modified_latitude" : 28.594516313024954,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284441228611982,
    "accessed_at" : "2023-12-26T01:26:21Z",
    "created_latitude" : 28.594516313024954,
    "created_at" : "2023-10-10T05:14:08Z",
    "modified_at" : "2023-10-10T05:21:45Z",
    "tags" : [

    ],
    "content" : "Science is the parental guiding hand. It is the Shepherd to which we trust. ",
    "flagged" : false
  },
  {
    "created_latitude" : 28.594516313024954,
    "created_at" : "2023-10-10T16:51:17Z",
    "modified_longitude" : -81.284441228611982,
    "tags" : [

    ],
    "created_longitude" : -81.284441228611982,
    "modified_at" : "2023-10-10T16:52:01Z",
    "folder" : 0,
    "accessed_at" : "2023-10-10T16:51:17Z",
    "content" : "One of the last new changes to occur to your routine when you move... finding the right barber again.",
    "uuid" : "E1DA6DD6-00E7-4DB4-94BA-DD1FE0B471AD",
    "modified_latitude" : 28.594516313024954,
    "flagged" : false,
    "languageGrammar" : "Markdown"
  },
  {
    "modified_longitude" : -81.284750147423594,
    "flagged" : false,
    "content" : "A mutilating, infatuating preoccupation with minds outside myself.",
    "modified_at" : "2023-10-10T19:52:44Z",
    "tags" : [

    ],
    "created_longitude" : -81.265218601346234,
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-10-10T19:43:07Z",
    "uuid" : "8F75CE8B-2A73-4E37-8941-F87C50BFC6EB",
    "created_at" : "2023-10-10T19:43:07Z",
    "created_latitude" : 28.618432107083358,
    "modified_latitude" : 28.594796063155986,
    "folder" : 0
  },
  {
    "created_at" : "2023-10-11T18:49:48Z",
    "accessed_at" : "2023-10-11T18:49:48Z",
    "modified_longitude" : -81.199677107902289,
    "modified_latitude" : 28.587448324487607,
    "uuid" : "B46D0CD5-FDD3-4DF9-9139-3884550C99C2",
    "folder" : 0,
    "flagged" : false,
    "created_latitude" : 28.588320046988237,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.198952202543694,
    "modified_at" : "2023-10-11T18:50:34Z",
    "content" : "I lived my life on eggshells."
  },
  {
    "tags" : [

    ],
    "created_latitude" : 28.593900374606992,
    "flagged" : false,
    "accessed_at" : "2023-10-12T02:53:21Z",
    "created_at" : "2023-10-12T02:17:05Z",
    "modified_at" : "2023-10-12T03:27:35Z",
    "content" : "I think what I just had was a panic attack.\n\nI had stepped into Austin's Coffee when I hear that girls name called again. The one whose words raced my heart the first time I had visited. The only persons whose words had ever stirred me so intensely. It was by my first step, then, did I begin feel a great deal of anxiety.\n\nIt was on my second step where it happened to rise immensely; as even with the even bigger crowd filling up what space they could, I could tell that the girl I was really here for, wasn't. Her scarlet red hair makes her easy to spot. I scanned the people by the poet as she scooches her way to the front. Missing. The same everywhere I look.\n\nMy heart was racing again. In a blurry moment I was at the other side of the small coffee shop, standing with the clipboard to sign my name. Standing by the real front door, I was wedged incredibly close with one of the organizers and cameramen. Trapped between a corner, a videographer, and the profile of a girl unknowingly preparing to palpate my heart. I looked down to see the list. I was pretty much last, long after the 30 minute break. My body knew I had one point, very very recently, wanted to sign up. My hand moved to compulsively correct the wonky letter 'd' before I gave my attention to her. For a moment, I felt myself relaxing, ready to be ask for nothing than to be seen. That was more than simple for me. Despite the less-than-ideal circumstances of my captivity, I was happy to set aside the tangled mess of anxiety weighing on me.\n\nThen she begins her poem.\n\nIn my greatest frustration, what transpired were experiences that are indescribable. It's as if every attempt of language I make to define it is a laughable, insulting misrepresentation. No order of words creates an order of magnitude large enough, to compare.\n\nAll of this lingers in the air as she steps down from the stage, like a giant down from the clouds. In my mind, though, it's like person stepping on an ant, the crushing weight coming back all at once.\n\nFree from captivity, I lose myself completely. In an screamingly empty mind, a pained faced, and a fleet foot, I begin wandering. I wander across the bar to leave towards my car for my earbuds case. I wander into the bathroom to shamble around the bathroom for a minute. I look for somewhere, anywhere I can be where I don't have to return to the anxiety.\n\nSoon though, the next poet was called to begin his set. I stood against a newly opened piece of wall, a place thankfully I felt was comfortable enough to stop my wandering.\n\nWith no choice now, I faced all that I had just felt. I recalled her poem, and in fraction of a second, I came to a soul-rendering realization:\n\nI was not there for myself. I spent the last week thinking about poetry, struggling to write one, and then arriving to a coffee shop alone with a half completed poem I had written 30 minutes prior. Like a procrastinating student, I didn't put any care into the writing. No, instead, I was there to interact with and--in my mind--impress a girl I had spoken to a few times a week before. The depth and gravity of the girls words shook my center so deeply it made me realize that the I, the person standing there in awe, was not me. The words I had written to recite were not mine.\n\nIt wasn't long before I had scratched my name out on the list and stepped out into the rainy night again.",
    "folder" : 0,
    "created_longitude" : -81.361475393180001,
    "languageGrammar" : "Markdown",
    "uuid" : "CAE24F3E-CE7F-4FD7-9FD8-EC9E3EFFFE74",
    "modified_latitude" : 28.593175055460385,
    "modified_longitude" : -81.361399914153338
  },
  {
    "created_at" : "2023-10-13T20:04:33Z",
    "modified_latitude" : 28.551141458957158,
    "modified_at" : "2023-10-13T20:08:08Z",
    "modified_longitude" : -81.58824369738899,
    "content" : "An obsession with legacy is to prepare for your life to begin upon your demise.",
    "uuid" : "80543DD1-E082-479A-947D-0016F9829A81",
    "created_longitude" : -81.564160674392028,
    "accessed_at" : "2023-12-26T01:26:14Z",
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "folder" : 0,
    "flagged" : false,
    "created_latitude" : 28.55135212695696
  },
  {
    "folder" : 0,
    "modified_latitude" : 28.559388904858899,
    "created_latitude" : 28.55616918943257,
    "created_longitude" : -81.683037087398816,
    "modified_at" : "2023-10-13T20:46:41Z",
    "flagged" : false,
    "uuid" : "6188C120-1293-4444-B71D-96FB0755176E",
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.682595824898854,
    "accessed_at" : "2023-12-26T01:26:07Z",
    "created_at" : "2023-10-13T20:45:03Z",
    "content" : "I feel so constantly, intensely, incessantly scrutinized on every detail of mine because... I was when I was a child.",
    "tags" : [

    ]
  },
  {
    "folder" : 0,
    "tags" : [

    ],
    "created_latitude" : 28.593637028415625,
    "modified_longitude" : -81.716699580945118,
    "modified_latitude" : 28.603402018321152,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.722973481160338,
    "content" : "I catch myself, waiting at crosswalk, searching for any sort of attention from sitting drivers. Desperate to see their grimacing face, assume their negative assumptions about me. Like I want them to look down on me.\n\nHow I want them to look down on me.",
    "uuid" : "BDB29D53-CFD5-40AE-A322-F85250E509B7",
    "created_at" : "2023-10-13T21:26:56Z",
    "modified_at" : "2023-10-13T21:33:38Z",
    "accessed_at" : "2023-10-13T21:26:56Z",
    "flagged" : false
  },
  {
    "created_latitude" : 28.609512356794315,
    "accessed_at" : "2023-10-13T21:54:44Z",
    "modified_longitude" : -81.718462297092771,
    "content" : "The right to exist is more often a realization than a resting fact, to me.",
    "created_longitude" : -81.718462297092771,
    "flagged" : false,
    "modified_latitude" : 28.609512356794315,
    "created_at" : "2023-10-13T21:54:44Z",
    "uuid" : "6B2B9E54-76E9-4AF7-8438-2159EFA47D2E",
    "folder" : 0,
    "modified_at" : "2023-10-13T21:55:28Z",
    "tags" : [

    ],
    "languageGrammar" : "Markdown"
  },
  {
    "created_longitude" : -81.208593151733183,
    "modified_latitude" : 28.593122335816989,
    "modified_longitude" : -81.208593151733183,
    "tags" : [

    ],
    "modified_at" : "2023-10-15T02:54:39Z",
    "accessed_at" : "2023-10-15T02:54:17Z",
    "uuid" : "F6736D99-E767-417A-9586-5B7413550624",
    "created_latitude" : 28.593122335816989,
    "flagged" : false,
    "created_at" : "2023-10-15T02:54:17Z",
    "content" : "Low",
    "folder" : 0,
    "languageGrammar" : "Markdown"
  },
  {
    "created_at" : "2023-10-15T02:55:56Z",
    "modified_latitude" : 28.59758102351957,
    "created_latitude" : 28.59758102351957,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-10-15T02:58:21Z",
    "content" : "Steady stream of high entropy over a long period = no life. Steady stream of low entropy over short period = life. Same amount of ending entropy and yet, one is more useful.",
    "modified_longitude" : -81.208274156377598,
    "flagged" : false,
    "accessed_at" : "2023-10-15T02:55:56Z",
    "uuid" : "9C6A29C2-CAF5-4911-BDEF-86A009F7732B",
    "created_longitude" : -81.208274156377598,
    "folder" : 0,
    "tags" : [

    ]
  },
  {
    "tags" : [

    ],
    "created_latitude" : 28.594515311634424,
    "created_longitude" : -81.284437921551401,
    "modified_at" : "2023-10-15T03:11:41Z",
    "content" : "Everything that has the capacity to change is one that goes by many names.",
    "flagged" : false,
    "modified_latitude" : 28.594756080557516,
    "accessed_at" : "2023-10-15T03:08:41Z",
    "created_at" : "2023-10-15T03:08:41Z",
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.284723901343227,
    "folder" : 0,
    "uuid" : "FFAE055F-EF6B-4AE3-BBB8-1E9117DCA150"
  },
  {
    "modified_longitude" : -81.164011184426371,
    "folder" : 0,
    "uuid" : "FE9C467E-CE3D-4894-8741-29A815FA50D8",
    "accessed_at" : "2023-10-15T21:50:03Z",
    "flagged" : false,
    "modified_latitude" : 28.561888695916082,
    "created_longitude" : -81.164011184426371,
    "created_latitude" : 28.561888695916082,
    "modified_at" : "2023-10-15T21:50:48Z",
    "content" : "Writing prompts for AI generated content is quickly becoming an expressive and beautiful art form.",
    "created_at" : "2023-10-15T21:50:03Z",
    "languageGrammar" : "Markdown",
    "tags" : [

    ]
  },
  {
    "tags" : [

    ],
    "created_latitude" : 28.561922080025155,
    "modified_longitude" : -81.164003964868442,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-10-15T21:58:44Z",
    "uuid" : "5660A5ED-7AA0-443B-96BD-8179ECA75440",
    "created_longitude" : -81.163899268584757,
    "folder" : 0,
    "content" : "If life is the one the universes best methods of increasing entropy... what's even better?",
    "modified_latitude" : 28.561882508382315,
    "accessed_at" : "2023-10-15T21:57:43Z",
    "created_at" : "2023-10-15T21:57:43Z",
    "flagged" : false
  },
  {
    "modified_latitude" : 28.56188030455948,
    "created_at" : "2023-10-15T23:41:06Z",
    "tags" : [

    ],
    "accessed_at" : "2023-10-15T23:41:06Z",
    "content" : "A game where the player IS the map.",
    "flagged" : false,
    "modified_longitude" : -81.164009486015459,
    "created_latitude" : 28.56188030455948,
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "uuid" : "EC380129-A16E-40D7-9462-9A9879E5EE88",
    "created_longitude" : -81.164009486015459,
    "modified_at" : "2023-10-15T23:41:18Z"
  },
  {
    "created_latitude" : 28.561906368042557,
    "created_longitude" : -81.163857973467515,
    "accessed_at" : "2023-10-15T23:54:36Z",
    "content" : "A game where the player IS the phenomenon of wave function collapse.",
    "modified_longitude" : -81.164010081584351,
    "uuid" : "4E1C6E4B-7B89-464D-9C9B-9D25312A63CF",
    "folder" : 0,
    "tags" : [

    ],
    "created_at" : "2023-10-15T23:54:36Z",
    "modified_at" : "2023-10-15T23:55:31Z",
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.561886386484524,
    "flagged" : false
  },
  {
    "accessed_at" : "2023-10-15T23:59:02Z",
    "tags" : [

    ],
    "folder" : 0,
    "flagged" : false,
    "uuid" : "26BFFCEF-7952-4FC7-906D-5586BD7B0B52",
    "modified_latitude" : 28.561890593156274,
    "created_at" : "2023-10-15T23:59:02Z",
    "modified_longitude" : -81.164011685384736,
    "modified_at" : "2023-10-16T00:04:46Z",
    "content" : "A hallmark of great game design is observing that the small increase of player freedom in some basic quantifiable manner results in exponentially greater increase in gameplay complexity... Something no doubt a necessary component to maximize the gamut of creative expression.",
    "created_latitude" : 28.561880040636382,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.164008937600244
  },
  {
    "uuid" : "E5EC9002-2F6F-414C-89CB-D60B136B67EE",
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.1925630792703,
    "modified_latitude" : 28.563540029283644,
    "tags" : [

    ],
    "created_latitude" : 28.561882512420841,
    "folder" : 0,
    "content" : "The little pieces of physical evidence marking quickly abandoned projects that I have seemingly spent my life scattering about in a blind panic have often served to only upset the current me. I would see them as another notch on the whipping belt of failure, delivering another lashing upon my back. Standing as I do now, in a place somewhere within \n\nNow here I stand. Standing aware, both within and without its context. ",
    "modified_at" : "2023-10-16T01:09:35Z",
    "accessed_at" : "2023-12-26T01:34:04Z",
    "created_longitude" : -81.164002749573513,
    "created_at" : "2023-10-16T00:59:39Z",
    "flagged" : false
  },
  {
    "content" : "You don't learn a style of expression. A style of expression finds itself manifesting through the use of your body.",
    "modified_at" : "2023-10-16T01:16:15Z",
    "accessed_at" : "2023-10-16T01:15:10Z",
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "modified_longitude" : -81.24094380300032,
    "created_longitude" : -81.196975009591497,
    "tags" : [

    ],
    "modified_latitude" : 28.570608280787905,
    "created_at" : "2023-10-16T01:10:18Z",
    "folder" : 0,
    "uuid" : "0360FF4E-9934-41F4-81CB-5E38B1995DF3",
    "created_latitude" : 28.565766359706004
  },
  {
    "uuid" : "466EA466-82B3-4436-AFBF-82BF56F09D64",
    "modified_longitude" : -81.28443792303365,
    "tags" : [

    ],
    "created_longitude" : -81.28443792303365,
    "modified_latitude" : 28.594515317342555,
    "folder" : 0,
    "created_latitude" : 28.594515317342555,
    "created_at" : "2023-10-16T03:20:55Z",
    "modified_at" : "2023-10-16T03:36:16Z",
    "content" : "There is a paradox hiding in human desire to collect, research, and archive the universe. The persistence of knowledge is an entropic endeavor. Energy spent persevering information is energy unusable for future discovery.\n\nAnd yet, what can be said of discovery but the embodiment of negentropy? Reliant facts form the foundation of all judgement for humans, machines, and beasts alike. It can be said that a nexus of knowledge proceeds a nexus of society. Just as knowledge is useful when gathered, so too are people.",
    "accessed_at" : "2023-12-26T01:33:34Z",
    "languageGrammar" : "Markdown",
    "flagged" : false
  },
  {
    "content" : "I'm all too eager to bequeath title of most beloved to anyone on Earth but myself.\n\nWhy?",
    "modified_longitude" : -81.196364387945451,
    "modified_at" : "2023-10-16T20:31:54Z",
    "created_longitude" : -81.196168169452051,
    "accessed_at" : "2023-10-16T20:29:03Z",
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "folder" : 0,
    "uuid" : "03145D20-0857-4F60-B2BB-47AB1E12EA9C",
    "created_at" : "2023-10-16T20:29:03Z",
    "modified_latitude" : 28.608697922927,
    "flagged" : false,
    "created_latitude" : 28.610648250519649
  },
  {
    "modified_latitude" : 28.598817122195573,
    "flagged" : false,
    "created_at" : "2023-10-16T21:01:40Z",
    "modified_longitude" : -81.242856609303857,
    "created_longitude" : -81.214678368863503,
    "uuid" : "C26274D2-4666-49E4-947F-9DEF35CEF2AC",
    "accessed_at" : "2023-10-16T21:01:40Z",
    "modified_at" : "2023-10-16T21:13:02Z",
    "tags" : [

    ],
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "content" : "If my life could be divided into stages where:\n\n1. Unaware of Problem & Solution\n2. Aware of Problem, Unaware of Solution\n3. Aware of Problem & Solution\n\nThen stage 1 lasted until early 23 (approximately between 23 0 months and 23 3 months), stage 2 until perhaps 3 months ago (approximately 24 years, 3 months). Understanding of what truly controls me has so far only been taken 4 or 5% of my time alive. And yet I feel there is so many many lifetimes more to learn still.",
    "created_latitude" : 28.597338491275373
  },
  {
    "created_at" : "2023-10-17T01:07:12Z",
    "content" : "The moment I decided I am more unique rather than less, is the moment I truly began to step into myself.",
    "uuid" : "CB4FD0CA-39A3-4CF7-A629-BC185B4A8403",
    "modified_longitude" : -81.284463665227847,
    "tags" : [

    ],
    "folder" : 0,
    "flagged" : false,
    "created_longitude" : -81.284463665227847,
    "created_latitude" : 28.594525560872597,
    "modified_at" : "2023-10-17T01:08:36Z",
    "modified_latitude" : 28.594525560872597,
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-10-17T01:07:12Z"
  },
  {
    "created_at" : "2023-10-17T16:41:35Z",
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "created_latitude" : 28.595185924607186,
    "modified_at" : "2023-10-17T16:44:20Z",
    "tags" : [

    ],
    "modified_longitude" : -81.284438189300431,
    "uuid" : "80A821D7-ED1D-4F9B-8009-D5AC38448DFC",
    "accessed_at" : "2023-12-26T01:33:27Z",
    "created_longitude" : -81.285353830488361,
    "content" : "At a very young age, I decided to always choose my discomfort over others. In a sense, I took up the role of a negativity sink. A conduit ",
    "modified_latitude" : 28.594515446828296
  },
  {
    "content" : "If knowledge is the barrier of entropy, and the restriction and control of knowledge authoritarian...\n\nFacism is an entropic process.",
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284438189300431,
    "flagged" : false,
    "uuid" : "AF0C7DBA-107A-40D5-AE88-2B0BFE23B700",
    "accessed_at" : "2023-12-26T01:33:10Z",
    "created_at" : "2023-10-18T15:00:36Z",
    "folder" : 0,
    "modified_latitude" : 28.594515446828296,
    "created_latitude" : 28.594515446828296,
    "tags" : [

    ],
    "modified_at" : "2023-10-18T15:02:30Z",
    "modified_longitude" : -81.284438189300431
  },
  {
    "flagged" : false,
    "tags" : [

    ],
    "content" : "The sun sends packets of high (useful) energy. The life is the byproduct of the Earth taking this high energy and bringing it to a low (useless) energy state to radiate it over time.\n\nIn the end, the energy in the system remains constant. It simply the density of energy over time that differs. In that difference, life forms.",
    "modified_longitude" : -81.256210974174749,
    "modified_latitude" : 28.597222638701883,
    "uuid" : "080F3766-743F-4698-9F7B-371745B241BC",
    "modified_at" : "2023-10-18T15:55:21Z",
    "accessed_at" : "2023-12-26T01:27:16Z",
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.28433379707873,
    "folder" : 0,
    "created_at" : "2023-10-18T15:49:35Z",
    "created_latitude" : 28.595298026296856
  },
  {
    "created_longitude" : -81.225756867469457,
    "content" : "Collecting data, quantifying phenomena, and numbers in general, are perhaps innately satisfying because they are the physical forms of potential future low entropy. \n\nIf you had a very large flock of sheep, and I asked you how many sheep you had, how would you proceed? How would you transmit this information?\n\nCould you perform the work are required to ascertain the necessary information with reasonable certainty, and grasp the answer to my question without the use of numbers? Most definitely.\n\nNumbers and other pieces of information are like little packets of (perceived?) low entropy. I say perceived, because numbers and their ilk are human mental constructs, and therefore are nonexistent outside it.\n\nWhile they may or may not exist, numbers do present the offer of reducing future effort on your part. For the low(er) entry price of counting your sheep, plus the slow and steady cost of storage, either physical or chemical (a funny way of writing physical), you now eternally possess access to information that you wouldn't have otherwise, given the amount of time. Sure, counting sheep is a largely inconsequential (not to mention exhausting) task, the knowledge extracted offering a low probability of proving useful. Who's to say, however, what that probability truly is? It very well may be entirely subjective and perceptive. Could I perceive of a future in where my fate of life hinges upon the degree of access I have to some number of sheep? Absolutely. Does that possible future seem compelling enough for me that I should preemptively work to grasp it? It seems like a gamble, a matter of opinion. Perhaps there is a objective probability, but it may very well be meaningless in the macro context of our lives.\n\nInformation is only as useful as the amount of energy it offers to save.",
    "tags" : [

    ],
    "accessed_at" : "2023-12-26T01:27:52Z",
    "folder" : 0,
    "flagged" : false,
    "modified_longitude" : -81.284438207736301,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.597439915343784,
    "created_at" : "2023-10-18T21:19:15Z",
    "uuid" : "FFE9BA80-AC31-4075-BCA6-1CA802A3708A",
    "modified_latitude" : 28.594515331044384,
    "modified_at" : "2023-10-18T22:26:24Z"
  },
  {
    "folder" : 0,
    "flagged" : false,
    "modified_latitude" : 28.594515331044384,
    "created_latitude" : 28.594515331044384,
    "modified_at" : "2023-10-18T21:39:43Z",
    "uuid" : "B24E37F2-68A3-4502-9301-630C0D9F094F",
    "accessed_at" : "2023-10-18T21:38:56Z",
    "content" : "To believe you are loved by all is vanity, and to be loved by none, hearsay.",
    "created_longitude" : -81.284438207736301,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.284438207736301,
    "created_at" : "2023-10-18T21:38:56Z"
  },
  {
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-10-18T23:01:51Z",
    "modified_longitude" : -81.238275367778783,
    "uuid" : "A2D14C75-B529-4957-BACC-887ED7DF5700",
    "modified_latitude" : 28.597429142342595,
    "content" : "One is Two\nTwo is Theee",
    "tags" : [

    ],
    "accessed_at" : "2023-10-18T23:01:27Z",
    "created_latitude" : 28.597422582085809,
    "created_longitude" : -81.239397042619046,
    "created_at" : "2023-10-18T23:01:27Z",
    "flagged" : false,
    "folder" : 0
  },
  {
    "modified_latitude" : 28.618630904704993,
    "content" : "",
    "folder" : 0,
    "created_latitude" : 28.618630904704993,
    "created_at" : "2023-10-20T17:08:04Z",
    "accessed_at" : "2023-10-20T17:08:04Z",
    "flagged" : false,
    "tags" : [

    ],
    "modified_at" : "2023-10-20T17:08:47Z",
    "languageGrammar" : "Markdown",
    "uuid" : "A3D26E0F-00C8-4032-80F1-3609BE2DE344",
    "modified_longitude" : -81.26130184474755,
    "created_longitude" : -81.26130184474755
  },
  {
    "created_latitude" : 28.671335099676583,
    "uuid" : "A62CB958-04C9-4FAF-BE6B-CC4804C1AAC2",
    "modified_at" : "2023-10-21T02:34:13Z",
    "flagged" : false,
    "created_at" : "2023-10-21T02:30:00Z",
    "created_longitude" : -81.307960408700197,
    "modified_longitude" : -81.310601962855188,
    "content" : "A power too great for this world to ever be fully realized. They say that is known as prayer, but that just sounds cool philosophically.",
    "tags" : [

    ],
    "folder" : 0,
    "accessed_at" : "2023-10-21T02:30:00Z",
    "modified_latitude" : 28.67068532963189,
    "languageGrammar" : "Markdown"
  },
  {
    "created_longitude" : -81.284438637056041,
    "content" : "What is a rule that is broken more often that it is kept?",
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-10-21T17:12:54Z",
    "flagged" : false,
    "uuid" : "C21408FA-5BDC-4A3A-81E6-710735C58885",
    "modified_at" : "2023-10-21T17:13:11Z",
    "modified_latitude" : 28.594516041736433,
    "tags" : [

    ],
    "created_latitude" : 28.594516041736433,
    "folder" : 0,
    "modified_longitude" : -81.284438637056041,
    "created_at" : "2023-10-21T17:12:54Z"
  },
  {
    "accessed_at" : "2023-10-21T21:30:58Z",
    "created_latitude" : 28.544180053001107,
    "folder" : 0,
    "modified_latitude" : 28.544180053001107,
    "tags" : [

    ],
    "created_longitude" : -81.375645062679851,
    "flagged" : false,
    "modified_at" : "2023-10-21T21:31:04Z",
    "languageGrammar" : "Markdown",
    "uuid" : "D62B1105-04BD-4751-B3C9-5AE3BBD5945F",
    "created_at" : "2023-10-21T21:30:58Z",
    "content" : "Sea",
    "modified_longitude" : -81.375645062679851
  },
  {
    "folder" : 0,
    "modified_latitude" : 28.594859591074769,
    "modified_longitude" : -81.285189505215754,
    "created_at" : "2023-10-21T23:07:59Z",
    "created_longitude" : -81.354095743522279,
    "content" : "It may be the case that I believe that the question:\n\nIs a fetus\/clump of cells a conscious being, deserving of rights?\n\nIs fundamentally exactly the same question as:\n\nIs a supposed \"sentient\" Artificial Intelligence a conscious being, deserving of rights?\n\nTo be plain: these questions relate their subject to the singular crux of a greater dilemma. It represents the uneasy demarcation in the scale of complexity that we have to yet confront. There may never be a line in the scale of Life that we all agree separates living things from ostensibly not living things.\n\nWe can describe brains or AI as biological or technological machines, but those terms are really aliases for electrical, which itself is an alias for physical. That is to say, consciousness then is an entirely physical phenomenon, if I ascribe to this logic.\n\n\nI sense that the first man made \"sentient\" life will likely be created in the colloquially known biological form. This could be for many reasons, but one I find interesting is because of our natural biological bias. A sentient, fully articulate AI would not nearly as Earth-shattering as a much more simple but biological (and physically visible) macro-organism.\n\n",
    "modified_at" : "2023-10-21T23:35:41Z",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "created_latitude" : 28.553157032500199,
    "uuid" : "2C836487-8B10-4DD8-A61E-0FB0B2CF032E",
    "accessed_at" : "2023-10-21T23:07:59Z"
  },
  {
    "created_latitude" : 28.594533225306154,
    "folder" : 0,
    "flagged" : false,
    "created_longitude" : -81.284425705577362,
    "created_at" : "2023-10-22T16:47:58Z",
    "accessed_at" : "2023-10-22T16:47:58Z",
    "modified_at" : "2023-10-22T17:06:07Z",
    "tags" : [

    ],
    "modified_latitude" : 28.59453322071014,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.28442556106512,
    "content" : "There is a certain contentment to find in the transitive process from a personal, idiosyncratic envy to the common, shared adoration. A type of perspective reframing where we do not strive for equal value, an incoherent struggle. Rather, we venerate all that comes to be in this universe, as the wonderful miracle that existence is. It is an understanding that we simultaneously can never come to possess anything in the universe, and it is everything that   will in time, come to possess us. To relinquish that phony crown of Master, to take our throne within the audience of reality, and to revel in the majesty on the stage, quite literally the performance of a lifetime.",
    "uuid" : "38314E0C-2DEF-4190-A72B-590E0BA60305"
  },
  {
    "folder" : 0,
    "created_at" : "2023-10-24T00:38:53Z",
    "created_latitude" : 28.594515561888485,
    "flagged" : false,
    "accessed_at" : "2023-10-24T01:06:52Z",
    "modified_latitude" : 28.594515561888485,
    "created_longitude" : -81.284437554383288,
    "modified_longitude" : -81.284437554383288,
    "languageGrammar" : "Markdown",
    "uuid" : "26CACF23-745A-4837-A9DE-5D1E2DE85D1A",
    "modified_at" : "2023-10-24T01:36:18Z",
    "content" : "To live is to suffer. To suffer is to experience change where one desires stability. \n\nTo experience change is as basal a fear as a life could experience. It is what guides evolution of all species. Seeking stability in existence means a greater chance of your survival and so your progeny may live on. It might be fair to define life in this manner; a \"system\" that has mechanisms that prolong its \"existence\" through avoiding change and seeking stability. Perhaps life is all around us then, in the macro and micro scales of our universe. We simply haven't realized where to draw the lines of separation between the life forms.\n\nLife exists in what desires to persist.\n\nDeath is of course, the ultimate suffering, the ultimate change, the greatest possible break from the island of stability. It exists ontologically in this perspective; something must be the ultimate transitional state. Due to our ability to discern less suffering from more suffering, combined with our ability to conceive of immaterial or theoretical suffering, we are all but forced to perceive the concept of death.\n\nIn another way, death is not bona fide state of matter or a property of the universe. It is a strictly human construct, a name given for the combinational consequence of three distinct phenomena:\n\nthe physical mechanism\n\n- entropy, change.\n\nand the biological(?) mechanisms\n\n- the avoidance of change, which is the harbinger of uncertainty, threat, and strife.\n- the conception of possible large future change that is dependent on immediate smaller change, and the ability to make decisions that lead to the more optimal outcome.\n\nWhatever system can be said to possess these biological mechanisms has the property of 'life', and the subsequent removal of one or both 'death'.\n\nAn entity possessing the first mechanism without the second would behave similar to a zombie, or a very simple CPU opponent. Without the capacity to plan for the future, such a system would very quickly make \"decisions\" that would cause it's downfall. \n\nAn entity possessing the second but not the first would be a bizarre organism. It would have the acuity to understand and plan for future danger, but lack the desire to do so. Such behavior is totally antithetical to the continuation of life. Or, perhaps the entity is not governed by the physical law of entropy. Something that is not affected by change is also something that is not affected by suffering. I myself like to imagine the gods and their kin residing under this description. Beings who perceive the constant decay of the universe but themselves simply are not affected by it.\n",
    "tags" : [

    ]
  },
  {
    "created_longitude" : -81.284437554383288,
    "content" : "Thinking about the proliferation of life as the universes way of reaching a resting, max entropic state, I've come to recontextualize the true value in procreation and its beneficiaries. If our autonomy is a consequence of this universal end goal, then our children come into being not by our own machinations, but in service to that end.",
    "flagged" : false,
    "accessed_at" : "2023-10-28T22:32:35Z",
    "created_at" : "2023-10-25T03:44:44Z",
    "modified_at" : "2023-10-25T04:01:13Z",
    "tags" : [

    ],
    "uuid" : "C08D850D-A044-4ED8-A52D-9F2ADA749C01",
    "modified_longitude" : -81.284437554383288,
    "modified_latitude" : 28.594515561888485,
    "folder" : 0,
    "created_latitude" : 28.594515561888485,
    "languageGrammar" : "Markdown"
  },
  {
    "modified_longitude" : -81.284449535181921,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284449535181921,
    "flagged" : false,
    "folder" : 0,
    "created_at" : "2023-10-31T04:00:41Z",
    "created_latitude" : 28.594512968202284,
    "uuid" : "BA6CF168-D23A-4218-B9EF-81624D130EBE",
    "modified_at" : "2023-10-31T04:00:47Z",
    "content" : "Happy Halloween!!",
    "tags" : [

    ],
    "modified_latitude" : 28.594512968202284,
    "accessed_at" : "2023-10-31T04:00:41Z"
  },
  {
    "modified_at" : "2023-11-02T21:14:20Z",
    "accessed_at" : "2023-11-02T21:05:54Z",
    "created_at" : "2023-11-02T21:05:54Z",
    "flagged" : false,
    "uuid" : "10C0CC0E-650F-4289-A364-845ECB547196",
    "folder" : 0,
    "content" : "My choice whether or not I hyper-analyze some unanswered question is no longer up to me. It is now in my own minds interest to grind up against my most abrasive problems so as to become sharp enough to pierce right through.",
    "created_longitude" : -81.285901104457565,
    "modified_latitude" : 28.595209177610119,
    "created_latitude" : 28.595233327298835,
    "modified_longitude" : -81.286017308087352,
    "tags" : [

    ],
    "languageGrammar" : "Markdown"
  },
  {
    "folder" : 0,
    "modified_at" : "2023-11-02T21:53:06Z",
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.59498838633742,
    "content" : "The \"habit\" that compels a ball to roll down a hill and the habit that compels the addicts, the traumatics, and the convicts to relapse back towards their abuse, are not merely similar metaphorically. They to me, may fundamentally be exactly the same phenomenon. Their apparent difference is contingent on our limited perspective. Ironically, the very limitation that has allowed our more complex consciousness to develop, through the numerous 'hard-wired' abstractions and other processes our perceptive systems perform to constitute our reality.",
    "tags" : [

    ],
    "flagged" : false,
    "created_at" : "2023-11-02T21:43:44Z",
    "created_latitude" : 28.595172550220397,
    "accessed_at" : "2023-11-02T21:43:44Z",
    "modified_longitude" : -81.285564221011938,
    "uuid" : "9C0ADA64-C9D0-413B-8FD3-68A60479CB54",
    "created_longitude" : -81.285985288725684
  },
  {
    "created_latitude" : 28.428190122129646,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-11-04T04:56:08Z",
    "modified_longitude" : -81.284454895194386,
    "modified_latitude" : 28.594513214063539,
    "created_at" : "2023-11-03T20:20:31Z",
    "accessed_at" : "2023-11-04T03:55:01Z",
    "folder" : 0,
    "created_longitude" : -81.441824843236546,
    "uuid" : "42D1F122-D49E-4345-A4EA-993FF410D5F1",
    "tags" : [

    ],
    "content" : "Today, I felt the value in belonging to a group, and the evolutionary reason for its persistence. Walking around the Rosen College of Hospitality for the first time, I felt as I always did. Wary, overly cautious. There was more than a good reason for me to be there, but new territory comes alongside risk and general uncertainty. I began to quantify this elevated stress I felt as a product of the many assumptions I held in that moment. Like a fog of war, the many unknowns I was contending with all but forced a more conservative approach to all my decisions. More consideration had to be done, different angles to be checked and compared, and a greater volume of possibilities to be explored. In practice, this was expressing itself as a higher standing mental workload. An increased level of stress to accompany myself as I moved quickly and fully my out of my element.\n\nAfter some time being unable to find my scheduled room, and after hitting the same dead end hallway for the third time, I came to realize something else. Despite my never being on this campus, I still had a level of distinction here. Purely due to my status as a UCF student, I was granted things that others simply did not have. Nothing physical, but rather contextual and perhaps a tiny bit mental. What was given to me, was nothing short of relief from those many running assumptions I had to keep.\n\nPerhaps it is the same relief one would feel upon the weary sight of strangers on the horizon, flying your very same flag. A sharp, sudden reduction in the number of unknowns you now must contend with, it is exactly that process within our minds that we call 'relief'. In that moment, I was overcome with the realization of this stress energy leaving my body. It was more than clear to me that the source of this stress was the near uncountable number of concurrent processes I subconsciously wrought to life. Finally, it came to me that what I had just experienced was no doubt a personal case study of something quite evolutionary significant. The advantage one gains in associating themselves to groups is evidently massive. An identifiable group expression, like a flag or call, defeats those energy dense processes that we naturally run. In other words, information is \"pre-assumed\", and so our individual energy requirements are reduced. Propagate this over generations, and what results very well may be a species adept at identifying to, and defending a group, complete with a sworn oath and a vow to keep."
  },
  {
    "modified_longitude" : -81.345996879358168,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-11-06T23:19:23Z",
    "created_latitude" : 28.548106527913909,
    "accessed_at" : "2023-11-06T23:19:23Z",
    "folder" : 0,
    "uuid" : "82C7655D-9A52-4563-A8C8-44D85C2BAB67",
    "modified_at" : "2023-11-06T23:31:47Z",
    "modified_latitude" : 28.548066729337588,
    "content" : "It seems I can't let anything remain unexplained in my life. Crucially, that includes my own internal mysteries as well. It's not enough that I know the form of some mental or physical illness, I must also know its pathology, or its greater consequences as it cascades and collides with other issues of mine. Is it an attempt to grasp some underlying, unifying source from which all my malaise emerges?",
    "flagged" : false,
    "tags" : [

    ],
    "created_longitude" : -81.346317892969907
  },
  {
    "uuid" : "E0FD47AB-E9B0-42B3-B60C-2FDB8D0C4DF1",
    "created_at" : "2023-11-07T05:23:00Z",
    "content" : "Can you accept my invitation so that I can get 5 free gifts ? I‘m claiming 5 free gifts, valued at $173.35\nhttps:\/\/temu.com\/s\/62mTV5WOUavLdPg4",
    "modified_latitude" : 28.594388683501069,
    "accessed_at" : "2023-11-07T05:23:02Z",
    "created_latitude" : 28.594388683501069,
    "tags" : [

    ],
    "modified_longitude" : -81.283406709108817,
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "created_longitude" : -81.283406709108817,
    "flagged" : false,
    "modified_at" : "2023-11-07T05:23:02Z"
  },
  {
    "uuid" : "22E2AD1A-B39B-4E75-B47B-E3C431A36DEB",
    "created_latitude" : 28.594432716030457,
    "modified_latitude" : 28.594432716030457,
    "tags" : [

    ],
    "modified_at" : "2023-11-07T05:23:39Z",
    "folder" : 0,
    "content" : "Can you accept my invitation so that I can get 5 free gifts ? I‘m claiming 5 free gifts, valued at $173.35\nhttps:\/\/temu.com\/s\/I9ycXYSBRqOgBSF",
    "accessed_at" : "2023-11-07T05:23:39Z",
    "languageGrammar" : "Markdown",
    "created_at" : "2023-11-07T05:23:38Z",
    "modified_longitude" : -81.283791577823067,
    "created_longitude" : -81.283791577823067,
    "flagged" : false
  },
  {
    "created_at" : "2023-11-08T14:45:56Z",
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "modified_at" : "2023-11-08T14:46:24Z",
    "uuid" : "DC8E61AB-E5E4-4486-AC68-760FAC6BE9F5",
    "tags" : [

    ],
    "modified_longitude" : -81.284423880719004,
    "created_longitude" : -81.284423880719004,
    "modified_latitude" : 28.594500544786737,
    "content" : "If you say you'll never leave a place, that means you'll either live there forever, or die there forever.",
    "created_latitude" : 28.594500544786737,
    "accessed_at" : "2023-11-08T14:45:56Z",
    "flagged" : false
  },
  {
    "accessed_at" : "2023-11-09T21:39:21Z",
    "modified_latitude" : 28.568343920659803,
    "uuid" : "14F69123-7B54-49BC-B3F0-372CBCCC788A",
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.194943247285764,
    "folder" : 0,
    "created_at" : "2023-11-09T21:09:47Z",
    "created_latitude" : 28.568428823847196,
    "content" : "Perhaps my difficulty in finding it comfortable to speak my thoughts here, rather than typing them, is the same difficulty I face speaking to others. In my attempts to record voice memos or use speech-to-text, I can't help but catch myself, words on the precipice of my lips. The strain of each single syllable as it passes through, quivering jaw unable to find rest. I find that I may be bestowing too high a value on each word, and so I tend to reserve myself so as to never misspeak.\n\nAnother difficulty is found in my way of thinking. Evidently, I usually write sentences and concepts more concurrently, rather than the likely more conventional linear approach. It's less concerned with individual phrases, and more so with overall flow and expressed emotions that shine through. It's due to this tendency that ",
    "tags" : [

    ],
    "modified_at" : "2023-11-09T21:59:11Z",
    "modified_longitude" : -81.270768195466388,
    "flagged" : false
  },
  {
    "content" : "There is a you-shaped hole in my universe.",
    "modified_at" : "2023-11-10T22:32:28Z",
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "created_longitude" : -81.284441606192914,
    "created_at" : "2023-11-10T22:32:10Z",
    "modified_longitude" : -81.284441606192914,
    "modified_latitude" : 28.594517716579759,
    "flagged" : false,
    "created_latitude" : 28.594517716579759,
    "accessed_at" : "2023-11-10T22:32:10Z",
    "uuid" : "BB9A21BA-71D4-47E6-A6EB-D56B822C79A4"
  },
  {
    "created_latitude" : 28.594517716579759,
    "folder" : 0,
    "tags" : [

    ],
    "modified_latitude" : 28.594517716579759,
    "accessed_at" : "2023-11-11T01:10:35Z",
    "languageGrammar" : "Markdown",
    "content" : "Our desire to live and the desire of the universe to maximally exhaust available energy just so happen to overlap.",
    "modified_at" : "2023-11-11T01:11:45Z",
    "created_longitude" : -81.284441606192914,
    "flagged" : false,
    "created_at" : "2023-11-11T01:10:35Z",
    "modified_longitude" : -81.284441606192914,
    "uuid" : "C03D1CF5-02B6-4088-8028-15BB075FA196"
  },
  {
    "accessed_at" : "2023-11-12T00:36:55Z",
    "folder" : 0,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "uuid" : "0BB06F09-7B93-4225-9185-581E0665234A",
    "content" : "Life is like... a box of non-Newtonian fluid. Try too hard to change things and you'll find yourself trapped. Better to just sink right in.",
    "created_at" : "2023-11-12T00:36:55Z",
    "modified_at" : "2023-11-12T00:37:43Z",
    "modified_latitude" : 28.600120840661823,
    "created_longitude" : -81.200016786359456,
    "created_latitude" : 28.600120840661823,
    "modified_longitude" : -81.200016786359456
  },
  {
    "uuid" : "3D3BAF94-9F5D-4C3C-9173-4A679EBF5707",
    "accessed_at" : "2023-11-13T16:35:28Z",
    "tags" : [

    ],
    "content" : "If it is true that you are what you experience, then to wish to have the lives of others is truly a foolish desire. To gain such a demand is to lose the singular mark of existence; your unique identity.\n\nThere is two moments of when one shares a collective experience. The moment of birth, and the moment of death. Through this shared experience we become truly indistinguishable.",
    "created_longitude" : -81.198783809328617,
    "created_at" : "2023-11-13T16:28:06Z",
    "modified_longitude" : -81.193054258174854,
    "created_latitude" : 28.590168844046673,
    "flagged" : false,
    "modified_latitude" : 28.589644907994064,
    "modified_at" : "2023-11-13T16:39:32Z",
    "languageGrammar" : "Markdown",
    "folder" : 0
  },
  {
    "content" : "You ever meet a girl that is so good and driving you insane she doesn't even know it?",
    "modified_latitude" : 28.596796343595877,
    "modified_at" : "2023-11-13T18:46:12Z",
    "accessed_at" : "2023-11-13T18:45:39Z",
    "uuid" : "62A500EA-E69A-4FDB-B679-BFE174412D3A",
    "folder" : 0,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-11-13T18:45:39Z",
    "modified_longitude" : -81.201985123672316,
    "created_latitude" : 28.596796343595877,
    "tags" : [

    ],
    "created_longitude" : -81.201985123672316
  },
  {
    "created_longitude" : -81.340076719945827,
    "modified_longitude" : -81.340076719945827,
    "modified_latitude" : 28.640403746141406,
    "flagged" : false,
    "tags" : [

    ],
    "created_at" : "2023-11-14T21:42:57Z",
    "accessed_at" : "2023-11-14T21:42:57Z",
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "content" : "",
    "uuid" : "A1B63AE0-C934-4279-8EA6-978D743686C6",
    "modified_at" : "2023-11-14T21:43:09Z",
    "created_latitude" : 28.640403746141406
  },
  {
    "content" : "I feel strangely conflicted. I feel I should strive to share my experiences and way of thinking to bring about positive change in others. I also feel that doing so is antithetical to my very existence. Rather, it's that I do not want people to be like me. I do not want others to strive in perpetuity, in an effort to achieve the impossible. Not impossible because of any sort of deficiency, but because any energy spent in every single attempt would be nothing but wasted.",
    "uuid" : "0625D9C3-C737-4824-B013-52A053394E67",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-11-14T23:18:59Z",
    "modified_longitude" : -81.284439211231827,
    "folder" : 0,
    "flagged" : false,
    "modified_latitude" : 28.594517090219178,
    "accessed_at" : "2023-11-14T23:06:38Z",
    "created_at" : "2023-11-14T23:06:38Z",
    "created_longitude" : -81.284439211231827,
    "created_latitude" : 28.594517090219178
  },
  {
    "uuid" : "899F2F09-9808-4C32-A0A2-86621F98773F",
    "created_longitude" : -81.310609212799832,
    "tags" : [

    ],
    "folder" : 0,
    "flagged" : false,
    "modified_longitude" : -81.260888630510465,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-11-16T20:14:54Z",
    "created_latitude" : 28.552869966037484,
    "modified_latitude" : 28.617169804577809,
    "content" : "I get the same vibe from the arguments for the concept of religion and the concept of military. Sure, both were certainly required for humanity's survival and evolution. Yes, both have done many good things now and in the distant past. But we gotta ween off of both eventually, man.\n\nIt's like we're all collectively a traumatically abused child, now grown up but still in our own kind of survival mode. The world around us has changed. Our rose-thorned shields needn't be gripped so tightly. \n\nThere will be a time when we will finally grieve for all the abuse in our millennium long pasts. I shall not grieve in the face of these grievances, for the reason I do not grieve in the face of my own. It is but another rocky step, on the journey towards our unifying existence.",
    "accessed_at" : "2023-11-20T23:20:56Z",
    "modified_at" : "2023-11-16T20:52:04Z"
  },
  {
    "uuid" : "D0FE16B8-773C-4E9D-AEC2-3B26AAB62CA6",
    "modified_at" : "2023-11-18T15:40:14Z",
    "tags" : [

    ],
    "accessed_at" : "2023-11-18T15:38:42Z",
    "modified_latitude" : 28.594344867311605,
    "created_longitude" : -81.284438715588522,
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.28381667567038,
    "flagged" : false,
    "created_at" : "2023-11-18T15:33:19Z",
    "created_latitude" : 28.594516482485329,
    "content" : "It's not just that I needed someone who understood me back then, I feel now that I needed someone who felt just as misunderstood."
  },
  {
    "modified_longitude" : -81.426674276666176,
    "accessed_at" : "2023-11-19T21:11:19Z",
    "created_longitude" : -81.426069555411971,
    "created_latitude" : 28.439037231470564,
    "modified_at" : "2023-11-19T21:12:47Z",
    "content" : "I have a lot to go still on my acceptance of my many mental differences. I've spent so long fighting my own current, it's difficult not to return to that disruption.",
    "uuid" : "2A56C14E-D6AC-4CCE-8684-A8AD63063A3B",
    "folder" : 0,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "created_at" : "2023-11-19T19:48:15Z",
    "modified_latitude" : 28.437891961101851,
    "flagged" : false
  },
  {
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-11-19T20:44:12Z",
    "uuid" : "A6D79E16-E970-4B4B-B286-DD160F676FF0",
    "accessed_at" : "2023-11-19T20:44:12Z",
    "created_longitude" : -81.426497893097093,
    "content" : "I've always liked to the think that the reason I have trouble speaking is that my mind runs faster than my mouth. I got too much to express, always too much mental energy for my physical form to handle.",
    "tags" : [

    ],
    "modified_latitude" : 28.441531271019926,
    "flagged" : false,
    "modified_longitude" : -81.427283681264797,
    "modified_at" : "2023-11-19T20:47:08Z",
    "created_latitude" : 28.438682592035146
  },
  {
    "flagged" : false,
    "uuid" : "13C3CFFB-6BCF-459D-8A43-C0BAA2184C3F",
    "accessed_at" : "2023-11-22T19:07:25Z",
    "created_latitude" : 28.590975987490548,
    "modified_longitude" : -81.198895792783205,
    "folder" : 0,
    "created_at" : "2023-11-22T19:07:25Z",
    "created_longitude" : -81.199492931366137,
    "modified_latitude" : 28.590100823052268,
    "content" : "Satire can only exist where the original is well known. Take away the reference, and satire can very easily take its place.",
    "modified_at" : "2023-11-22T19:08:08Z",
    "tags" : [

    ],
    "languageGrammar" : "Markdown"
  },
  {
    "modified_longitude" : -81.208862727583579,
    "modified_latitude" : 28.67220471150122,
    "created_at" : "2023-11-23T18:37:32Z",
    "created_longitude" : -81.178535870929608,
    "content" : "I saw a two children pass by my vehicle, each riding bikes. The one leading had a neon fly fishing rod, held tightly between his right handlebar and its juvenile partner. The other followed closely behind, evidently searching for some available watering hole to try their luck at. As they continued passing me to my left, beyond my vision, my eyes returning focus to my light now turning green, I thought of something.\n\nMy childhood has always been on I had placed alongside my most instant shame. My origins, my introduction took into this world, my foundational toolbox from which I was given to construct my reality. There was no stronger association to all of these aspects of mine, than guilt, fear, anxiety. All these, potent concoctions like subtly terrible flavors variations, derived from that singular source, the very same brew of emotions that came to by my puppet master. Shame became the strings of this insipid voodoo witch that presided over me.\n\nI considered this shame, the many facets of my life for it it altered. As is my instinct, I began to consider the obvious, that it is all but probable that this alteration was for the \"worse\"...\n\nI stopped myself mid-thought. For a reason too complex for me to write or even conceive, I felt that my introduction of the concept of \"alteration\", felt simply wrong. On some deep, perhaps also instinctual level, yet intensely more vivid... to perceive of an alternation in my or any other existence is a fallacy of highest order.\n\nAcross one brief moment, within the sound of excited bikes hurriedly fading into our uncertain future, through their laughter and smiles reflecting on my rear view mirror and onto my face...\n\nI felt happy to be who I am. I felt humbled, grateful, lucky, to be given the opportunity to not only be granted a tiny, tiny, tiny place in this infinite transition of all things, but to be further blessed with a doomed, unceasing desire to observe this pervasive dance, in all ways it has to offer.\n\nAs I possessed this fact, sharply defined and comfortably held in the palm of my head... it was then that I applied it to the origin of this conflict, in one bounding leap hurling it against this crafty witch of mind. In doing so I began to see the facade of strength that shame presents, a facade it had to present. In the dust of that crumbling conjured conjurer within, could the profile of the truth be seen.\n\nThe ability to be happy now, a divine product of your life and its contradictory continuation, not only metaphysically but historically, is the ultimate gift we have been blessed to be given a lifetime to possess. There is nothing to be ashamed of that lives only in the past. There exists only things to love, because there was precisely what was needed at just the right time all coming together in perfect harmony, to create you where you stand.\n\nAs so, as a completed my turn, eventually accelerating further and further away on my own journey, I felt immense joy for those tribulations that pepper my past and while no doubt sprinkle my unknown future. I felt the lift of joy, too, as those two kids raced off, with their bikes and fishing rod.",
    "accessed_at" : "2023-11-23T21:14:09Z",
    "flagged" : false,
    "uuid" : "3385AD88-6892-4E14-9F6A-4F7BC63424FA",
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.659450240282982,
    "modified_at" : "2023-11-23T21:22:53Z",
    "folder" : 0,
    "tags" : [

    ]
  },
  {
    "flagged" : false,
    "uuid" : "953848D6-872A-400D-9907-D8418CCA7796",
    "created_at" : "2023-11-23T20:05:22Z",
    "accessed_at" : "2023-12-26T01:34:14Z",
    "languageGrammar" : "Markdown",
    "tags" : [

    ],
    "created_latitude" : 28.671204634356595,
    "created_longitude" : -81.171500268284518,
    "modified_at" : "2023-11-23T20:23:34Z",
    "modified_latitude" : 28.670084861039474,
    "content" : "A big inner conflict within me is if sex is, to me, intrinsically meaningful or not. If casual sex is no different than eating or sleeping, in all levels except socially, or if there truly is some emergent value in its conscious, responsible, respectful relationship. If respect could possibly exist in responsive attention towards one's bodily needs, irregardless of how (or who) makes me the happiest. Or, if the discipline in constrained monogamous or monosexual (or polygamous\/polyamorous, etc.), must offer some added benefit that had not revealed itself to me.\n\nMy relationship with sex flips between these two, often daily but sometimes by the minute. My rationales for installing dating apps could breach the heavens in size, overshadowed only by my rationales for deleting them. For the present moment, anyways.",
    "modified_longitude" : -81.177174421285628,
    "folder" : 0
  },
  {
    "created_latitude" : 28.845457124839758,
    "folder" : 0,
    "created_at" : "2023-11-25T20:55:07Z",
    "content" : "The story of a consciousness that has found a way to be the \"most\" immortal possible. It exists in an almost completely empty universe, all matter totally annihilated over the near infinite of time this being has sustained itself. Now, the last of the available particles to harvest energy has been captured. The remaining matter consists of the being, and the machine maintaining the beings' life, this mess of dwindling atoms built to collect these scattered particles countless eons before all remaining life finally succumbed to the hand of entropy. All life, except for one, infinitely lonely soul.\n\nThe being becomes aware of this fact, that the last of the possible energy in the universe has expired. The slimmest possible configuration of matter required to produce consciousness, floats in wait.\n\nThe machine, designed to self-cannibalize so to prolong the continuation of the being for truly as long as physically possible, should time still have any useful meaning. The being, with the knowledge of its utter imminent demise is where we as observers enter.",
    "tags" : [

    ],
    "uuid" : "692E8E0A-4AE1-4653-B0AB-B7AAAB48254F",
    "modified_longitude" : -81.163049424142699,
    "accessed_at" : "2023-11-25T20:55:07Z",
    "flagged" : false,
    "modified_at" : "2023-11-25T21:18:08Z",
    "created_longitude" : -81.137189892395881,
    "modified_latitude" : 28.84616444821361,
    "languageGrammar" : "Markdown"
  },
  {
    "created_at" : "2023-11-25T22:58:56Z",
    "modified_longitude" : -81.323105710909914,
    "accessed_at" : "2023-11-25T22:58:56Z",
    "uuid" : "FC58A1E0-E368-431B-B89D-31C6243DCFA5",
    "created_latitude" : 28.634979662507472,
    "flagged" : false,
    "folder" : 0,
    "modified_at" : "2023-11-25T23:06:42Z",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "content" : "The meaning of life is that in the cosmic quest to return to nothingness, your existence facilitates the quickest route for the universe to take, and so it does. In other words, you being born, being alive right at this very moment, yields the way to our shared annihilation. But to despair at this notion is to despair at the settling water at the below the falls, or the spread of gas slowly equalizing a room. It cannot be any other way, for it would have been so.",
    "modified_latitude" : 28.634858925290697,
    "created_longitude" : -81.322979563088694
  },
  {
    "modified_latitude" : 28.601206840553058,
    "created_latitude" : 0,
    "created_longitude" : 0,
    "uuid" : "E6C5E9C4-B140-4001-A14A-6450A1259B64",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.201186125496889,
    "accessed_at" : "2023-12-26T01:34:19Z",
    "flagged" : false,
    "content" : "I used to believe that the only option to feign some sort of happiness was to to lie to yourself. The tower of beliefs built within me had become so ingrained in my mind, like rigid guardrails they shaped and defined my every thought. So ingrained did they become that they eventually ceased to be, fading away in obscurity but not fading in its seeping control into my waking decisions. I thought, this was the way it simply, is. There were the beliefs that I had trusted to be pure, and there was my mind, eager to conform to those beliefs in the eternal pursuit of happiness. \n\nIt isn't difficult for me to declare that my longest standing feeling all my life has been a deep, penetrating incompatibly with those beliefs. ",
    "modified_at" : "2023-11-29T18:50:53Z",
    "folder" : 0,
    "created_at" : "2023-11-29T16:33:17Z"
  },
  {
    "modified_longitude" : -81.284440014217964,
    "accessed_at" : "2023-12-26T01:34:47Z",
    "content" : "Those like me have been bred to have the anxious mentality of a paranoid trap hunter. Compelled by a frequent dips into the survival instinct of fight-or-flight, value in predicting others became something of an obvious tool to use. We had been pushed into a role against our will, a role where taking the extra effort to build and set traps seems imperative, despite them constructed of mental rather than physical material, and their usefulness objectively questionable. Where our ",
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.261194214326153,
    "folder" : 0,
    "flagged" : false,
    "tags" : [

    ],
    "created_latitude" : 28.683834489781738,
    "uuid" : "39301193-7AA7-4640-B844-DFB20D91000B",
    "modified_at" : "2023-11-30T23:47:35Z",
    "modified_latitude" : 28.594517536474957,
    "created_at" : "2023-11-30T23:15:04Z"
  },
  {
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594528069162237,
    "modified_latitude" : 28.568542404126944,
    "tags" : [

    ],
    "uuid" : "BA4F567C-D8A4-4E41-BB98-5DF26C91C624",
    "modified_longitude" : -81.286101043300036,
    "accessed_at" : "2023-12-03T20:32:54Z",
    "created_at" : "2023-12-03T19:59:24Z",
    "created_longitude" : -81.284430686945697,
    "modified_at" : "2023-12-03T20:33:11Z",
    "content" : "",
    "folder" : 0
  },
  {
    "uuid" : "AC4622DD-B204-4601-8148-BBECDC56C8D7",
    "accessed_at" : "2023-12-26T01:34:51Z",
    "created_at" : "2023-12-05T20:26:28Z",
    "created_longitude" : -81.284440469484267,
    "modified_longitude" : -81.284440469484267,
    "modified_at" : "2023-12-05T20:28:15Z",
    "tags" : [

    ],
    "folder" : 0,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.594517532605586,
    "content" : "If it could always be worse, it always can be better.",
    "created_latitude" : 28.594517532605586
  },
  {
    "uuid" : "5FAC1F83-695E-4E7F-A3EC-965705BB60F0",
    "tags" : [

    ],
    "created_longitude" : -81.164079665701053,
    "modified_latitude" : 28.561901322693014,
    "created_latitude" : 28.561941223354676,
    "flagged" : false,
    "folder" : 0,
    "created_at" : "2023-12-10T16:13:25Z",
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-12-10T16:28:32Z",
    "accessed_at" : "2023-12-26T01:34:54Z",
    "content" : "If ones' wills and desires were instead some material part buried deep within a person, mine would have long necrotized in my hands, having been torn so voluntarily from its throne, to offered so easily at the feet of others.",
    "modified_longitude" : -81.164010261625904
  },
  {
    "created_latitude" : 28.594534558448682,
    "created_at" : "2023-12-12T15:36:47Z",
    "modified_longitude" : -81.284423792173811,
    "modified_at" : "2023-12-12T15:51:25Z",
    "flagged" : false,
    "created_longitude" : -81.284423792173811,
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.594534558448682,
    "tags" : [

    ],
    "folder" : 0,
    "uuid" : "09E55284-E6F5-4BA4-AD42-0706957DE082",
    "content" : "A perfect video game design would be one where the player is gated in progression due to strictly their own physical dexterity and their mental abilities. At no time is the will of an able-bodied and clever users' actions summarily stymied for reasons arbitrary, petty things like time and unexplained reasons.\n\nIn an RPG, if an early level player happens upon an end-game optional boss, it is up to this player as to whether they decide to bash their head against this immovable challenge, not the developer. The developer has already made a choice, by revealing this option to the player, by demonstrating a challenge to overcome. But a challenge that cannot be attempted is one that should not appear to be so attainable, save for an assumption by this developer of your abilities and your patience.",
    "accessed_at" : "2023-12-12T15:36:47Z"
  },
  {
    "created_at" : "2023-12-12T16:47:15Z",
    "content" : "",
    "tags" : [

    ],
    "folder" : 0,
    "created_longitude" : -81.284423792173811,
    "uuid" : "4DA80969-858C-4D29-A5D6-25072AFA844B",
    "flagged" : false,
    "modified_longitude" : -81.284423792173811,
    "modified_latitude" : 28.594534558448682,
    "accessed_at" : "2023-12-12T16:47:15Z",
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594534558448682,
    "modified_at" : "2023-12-12T16:47:27Z"
  },
  {
    "modified_longitude" : -81.284423792173811,
    "uuid" : "CB74CFDA-CC64-4533-A534-163CB432028D",
    "modified_latitude" : 28.594534558448682,
    "folder" : 0,
    "tags" : [

    ],
    "content" : "",
    "modified_at" : "2023-12-12T17:02:00Z",
    "flagged" : false,
    "created_at" : "2023-12-12T17:00:52Z",
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284423792173811,
    "accessed_at" : "2023-12-12T17:00:52Z",
    "created_latitude" : 28.594534558448682
  },
  {
    "created_latitude" : 28.594762834592228,
    "uuid" : "9802727E-56B5-42BA-99F8-846A06318B3E",
    "created_longitude" : -81.284594479345344,
    "modified_at" : "2023-12-12T23:56:26Z",
    "tags" : [

    ],
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.167347317700219,
    "flagged" : false,
    "created_at" : "2023-12-12T22:00:59Z",
    "modified_latitude" : 28.557611054719043,
    "accessed_at" : "2023-12-12T23:43:02Z",
    "content" : "Some sensation has come over me in recent weeks. A restless pull different than what I have known before. Not a Earthly pull down towards depression and destruction, it lacks the repugnance of man. No, this pull is upwards, northward, gentle. Something that could never be overshadowed by my own circular, fleeting desires.\n\nI have come to make sense of this uplifting feeling now. Another step on my journey of acceptance has been realized.\n\nSuch was a concern for the longest time; how does one know when they have achieved this \"acceptance\", and what does one do subsequently? While I understood that this journey is one never truly completed, it seemed logical to me that I would at some point feel this step end and another begin.\n\nNo, what this sensation, this never-ending pull forwards and upwards... this is acceptance, and it is at the same time not acceptance. Acceptance is not a flag or a checkpoint for me to cross, a notch on my chest after another battle won. It is a well residing deep there that can never be full. It is the grove that may take root there, sustained by the liquid found there, flourishing in abundance. Acceptance, is what there fills this well unfilllable.\n\nAnd so I've begun to see the grove shoot forth bolts of green and red and orange into the sky, once again overshadowing the withered, the dead, the untenably bound to Earth. What has grown is beautiful, and many more times is it bountiful. The joy it brings, pouring time and attention and passion into the well, as blossoms and fruits and color seemingly itself surround. It is a boundless, empty void of a hole in the best case possible. A happy friend, always willing to accept love for myself in exchange for the small price of deep affection with all."
  },
  {
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.284440877148242,
    "created_longitude" : -81.284440877148242,
    "tags" : [

    ],
    "uuid" : "8A44E06F-4E94-4D12-8282-73F987B92A52",
    "created_latitude" : 28.594515971040863,
    "created_at" : "2023-12-13T17:32:59Z",
    "accessed_at" : "2023-12-26T01:35:42Z",
    "modified_at" : "2023-12-13T17:43:03Z",
    "folder" : 0,
    "modified_latitude" : 28.594515971040863,
    "content" : "What would it mean for your wishes and your predictions to always be one in the same? Would their outcomes soon converge on each other, each pull on strengthening on themselves, through a force habitual? A phenomenon visible not spatially, but across ones' actions in time, and ultimately, a decider of the paths taken."
  },
  {
    "modified_longitude" : -81.198821990610327,
    "modified_at" : "2023-12-14T15:25:14Z",
    "created_at" : "2023-12-13T23:17:30Z",
    "languageGrammar" : "Markdown",
    "content" : "Any pain I have felt, any pain I will come to feel, I know now to be my automatic reluctance not to diverge from the way of things. The natural flow of all things I see myself immersed in has not possessed the clarity as it has these recent days. I have a seen a flow like this before, at certain times in my life. In those hours of passion and resolve, of clear course and steady hands. Those moments, when 'where I've been' has come to me to mean divinely perfect, that all of my mistakes and victories were precisely cogent in all ways conceivable. The flowing wisdom of the past pushing against my back, through me, piercing my skin, my bones, my mind, until the breach, and now transformed before my eyes it pulls, I a willing passenger of the futures' whims.\n\nThese were always fleeting moments, to me. Minutes of euphoria. The flow of all things revealed itself, but I did not understand its form or significance.\n\nI see myself, behind the wheel of a naval ship, hands firmly clasped on its spokes. My hands seem calm and at rest, as if finally finding long sought comfort. I see this rest in my arms, my shoulders, my face. The peace can be found in the ocean, in the birds far above my head, in the cloud and the sun and the shadow. I see the lines of the past again striking, flowing through my body, and the rays of the future extending forever beyond me. I sense my body moving forward on this infinite track, and I feel every thread sliding through every inch of me. This sensation is not one of constricting cosmic horror, but rather an endless well of contentment and satisfaction. It is this paradox, this marionette on strings with desire somehow ignited, that is worthy of lifelong devotion.",
    "folder" : 0,
    "modified_latitude" : 28.590158620009852,
    "tags" : [

    ],
    "uuid" : "D03F9137-2808-4612-81CC-7594616A94D1",
    "flagged" : false,
    "accessed_at" : "2023-12-26T01:36:10Z",
    "created_latitude" : 28.594516431762862,
    "created_longitude" : -81.284440436519787
  },
  {
    "created_at" : "2023-12-14T22:11:30Z",
    "created_latitude" : 28.58141429862555,
    "folder" : 0,
    "modified_latitude" : 28.590176905842107,
    "modified_longitude" : -81.19882681111234,
    "content" : "",
    "tags" : [

    ],
    "flagged" : false,
    "modified_at" : "2023-12-15T01:44:04Z",
    "accessed_at" : "2023-12-15T01:38:36Z",
    "created_longitude" : -81.208059088306797,
    "languageGrammar" : "Markdown",
    "uuid" : "EAD28530-8A5A-439D-8F70-E5B1DC657A24"
  },
  {
    "created_at" : "2023-12-15T15:39:03Z",
    "created_longitude" : -81.284442158698369,
    "uuid" : "1C6E3566-D63C-4D56-BF01-E9535BFFDF5D",
    "created_latitude" : 28.594515185266051,
    "modified_latitude" : 28.594515185266051,
    "tags" : [

    ],
    "modified_at" : "2023-12-15T15:41:37Z",
    "accessed_at" : "2023-12-29T17:53:27Z",
    "folder" : 0,
    "content" : "The simple belief in the unbounded goodness of each day itself takes you halfway there.",
    "modified_longitude" : -81.284442158698369,
    "flagged" : false,
    "languageGrammar" : "Markdown"
  },
  {
    "modified_at" : "2023-12-15T17:32:23Z",
    "tags" : [

    ],
    "uuid" : "55E6D724-68DA-4D55-82B5-B53938B9E1D8",
    "flagged" : false,
    "modified_longitude" : -81.319157003697313,
    "modified_latitude" : 28.539595063134449,
    "accessed_at" : "2023-12-15T17:14:27Z",
    "content" : "Advertising is a concerted effort to alter thoughts, and a proven strategy is a targeting demographics. The more relatable the characters and their situations, the burdens and desires that are unearthed and shaped to present, the easier it is for the audience to attach themselves to that character and situation, and feel what is there to be felt. This is all to say that, I shudder at the speed at which we are careening towards a disturbing reality. A reality where advertisements no longer use actors and sets, but perfect model simulations of your life. The pieces needed are quickly falling into place in my time. What could be more convincing, more relatable, more... thought altering, than to see and feel stories fed to you by those you hold most important?",
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.319257411020217,
    "created_at" : "2023-12-15T17:12:23Z",
    "created_latitude" : 28.5400416651479
  },
  {
    "folder" : 0,
    "modified_at" : "2023-12-15T22:18:24Z",
    "content" : "There truly is not such a thing as time!",
    "modified_latitude" : 28.594515282974086,
    "created_latitude" : 28.594444947495589,
    "uuid" : "EB8207EC-9281-4CF4-9133-F73E506460D6",
    "modified_longitude" : -81.284441789956489,
    "languageGrammar" : "Markdown",
    "created_at" : "2023-12-15T19:36:49Z",
    "tags" : [

    ],
    "flagged" : false,
    "created_longitude" : -81.284514864680517,
    "accessed_at" : "2023-12-15T22:18:20Z"
  },
  {
    "tags" : [

    ],
    "uuid" : "2205B865-3B8E-4C85-AD1E-F3C518D8AAA5",
    "modified_at" : "2023-12-15T22:19:14Z",
    "modified_longitude" : -81.284441789956489,
    "accessed_at" : "2023-12-15T22:18:29Z",
    "languageGrammar" : "Markdown",
    "modified_latitude" : 28.594515282974086,
    "folder" : 0,
    "created_longitude" : -81.284441789956489,
    "created_latitude" : 28.594515282974086,
    "content" : "All things ",
    "flagged" : false,
    "created_at" : "2023-12-15T22:18:29Z"
  },
  {
    "tags" : [

    ],
    "modified_at" : "2023-12-16T00:09:10Z",
    "uuid" : "5E506859-0B85-4D11-BFDF-F5552691B174",
    "accessed_at" : "2023-12-15T23:45:27Z",
    "created_longitude" : -81.284537632080543,
    "modified_latitude" : 28.594515282974086,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594485303346328,
    "content" : "The story of a life, gleaned only from the hands of its owner. A dozen or so dots define them, yet it is in their movements, their poses as they come, where we come in to understand. As is our human nature, though, the hands are cast in a subjective fog. Different to each of us entirely, the hands appear. They may be hands clasped in ribbons of gold and valor, or small fists hearing a weepy-eyed \"Farewell!\". The lonely hands missing their match, hands stained in blood and even still, hands rising to the beat of a new life. \n\nSo strange become the hands.\n\nSo nebulous they become. Capable of so much but yet... Just points in space, all of them. You cannot help but laugh, seeing the dots, seeing each struggle to maintain form, to not fully lose their collective. Barely hanging on, you think. This collection of dots are \"hands\", sure, if you really stretched your mind. Better not look away, for if you did you would not be able return to this sight, you are certain. You know that you'd lose that last hanging thread, whatever mental processing needed to see this \"thing\" here as hands, the moment quite literally anything else entered your thoughts.\n\n\nThe movements of hands, moving so hypnotically, seem to again be my guide.",
    "flagged" : false,
    "folder" : 0,
    "modified_longitude" : -81.284441789956489,
    "created_at" : "2023-12-15T22:49:47Z"
  },
  {
    "modified_latitude" : 28.594515282974086,
    "tags" : [

    ],
    "created_latitude" : 28.594515282974086,
    "flagged" : false,
    "modified_at" : "2023-12-16T00:36:30Z",
    "accessed_at" : "2023-12-19T01:30:51Z",
    "folder" : 0,
    "content" : "Are we not all gamblers? Placing a bet on our lives, a hot blooded challenge that our life has things yet to be determined? Value that lies restlessly dormant, brimming to be unearthed?\n\nIt is our fortune that we are afforded a seat at the table; that is nothing to say of opportunity to throw your set of dice.",
    "uuid" : "5BEF3B69-8975-447E-B153-230AB96B4B44",
    "languageGrammar" : "Markdown",
    "created_at" : "2023-12-16T00:19:34Z",
    "modified_longitude" : -81.284441789956489,
    "created_longitude" : -81.284441789956489
  },
  {
    "created_longitude" : -81.284441789956489,
    "accessed_at" : "2023-12-19T01:30:53Z",
    "languageGrammar" : "Markdown",
    "uuid" : "8C8345F0-4A7E-458B-BFF3-4BD5106BD171",
    "created_at" : "2023-12-16T00:41:09Z",
    "modified_longitude" : -81.284441789956489,
    "modified_at" : "2023-12-16T01:11:02Z",
    "modified_latitude" : 28.594515282974086,
    "tags" : [

    ],
    "created_latitude" : 28.594515282974086,
    "content" : "Gotcha.\n\nThere has been a sniveling notion that has avoided the spotlight of this decomposing gaze of mine. A thought so slippery and thin, wriggling it's way out of focus even now as I meditate upon it. It has already so nearly slipped  from me nine or ten just in the writing of these words. It, as if fearing capture and torture, apparently prefers to be on the periphery as it were. The type of thought that enjoys plenty company, and not much else. The type that has noted all the things that fall through the cracks in my daily reality, and that has chosen to wedge itself where (or rather, when) it is most liminal. An ever shrinking refuge it returns to, this weary concept. On an island in shadow within the boondocks of thoughts, the badlands of the forbidden, the painful, the quickly forgotten...\n\nWhat was I going to write?",
    "flagged" : false,
    "folder" : 0
  },
  {
    "created_at" : "2023-12-16T02:00:17Z",
    "uuid" : "1F397988-C935-4F4E-9548-81188DAF73D6",
    "content" : "So what, I tell myself, what is left of myself, that the rhythm I step to has had an audience before? That the words to which I am their spoken form, have once been written by others? The stars have not yet fallen from their mantle; each boundless sparkle has ample room for all wishes.",
    "folder" : 0,
    "tags" : [

    ],
    "modified_longitude" : -81.198712997214116,
    "accessed_at" : "2023-12-16T02:00:17Z",
    "created_latitude" : 28.58798674310426,
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-12-16T02:14:52Z",
    "flagged" : false,
    "created_longitude" : -81.208380684332184,
    "modified_latitude" : 28.59044804706107
  },
  {
    "languageGrammar" : "Markdown",
    "content" : "Just so I don't forget what has happened in the 5 or so hours since I stepped out of my apartment to work on my desk at my lab: \n\nfound a near endless supply of scrap wood left by our dumpster\nspent 20 minutes painfully dragging a fine specimen of a pallet some 50 feet\nNearly collapsed from exhaustion, forcefully vomited behind said dumpster\nWent on a walk on a trail behind campus connected to my lab\nAdmired the flag twirlers and color guard drilling late into the night, safe in the brush by the marching band tower\nStumbled upon disc golf, a radio tower, and a police pull over\nFound a strange white small room in the woods with a freezer-type door\nStalked a hapless family of deer, sang them songs and stepped slowly backwards to gain their trust\nHad some success, they appeared to like me (I witnessed closely, the characteristic sway of the white-tailed deer as the young fawn bounced away for the last time)\nNoticed a near immaculate piece of wood of the perfect dimensions for my desk in a huge dumpster as I neared my lab\nMade one more arduous journey as I championed the plank over to my domain\nRealized it was an old door, had a good chuckle\n\nMay every night be as passionate.",
    "created_at" : "2023-12-16T06:15:27Z",
    "flagged" : false,
    "created_longitude" : -81.198824402286064,
    "modified_at" : "2023-12-16T06:33:39Z",
    "modified_longitude" : -81.198824402286064,
    "modified_latitude" : 28.590179761004585,
    "folder" : 0,
    "created_latitude" : 28.590179761004585,
    "tags" : [

    ],
    "uuid" : "5D5DC2E2-7B3D-46B1-BBE6-CEFF7DC06BCD",
    "accessed_at" : "2023-12-16T06:15:27Z"
  },
  {
    "created_longitude" : -81.267345831725791,
    "modified_at" : "2023-12-20T21:02:16Z",
    "flagged" : false,
    "content" : "The youth will do what youth does, incessantly rejecting and upsetting their antipode. The elders in turn, do what they do because that is what elders do, offering their wisdom in no remittance to the youth. You see, there is a glaring contradiction by source, by substance, in all of these meaningless words. The elder is said here to be an extension on which hangs off of the youth, much like the branch of tree extends from a solid foundation. It is also the case here, that the youth is as well an extension of the elder in the same way. These two things, then are rooted in each other, dependent on the other for survival. This, I feel for certain.",
    "modified_longitude" : -81.267262505932777,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.648112035257597,
    "tags" : [

    ],
    "modified_latitude" : 28.647819506860809,
    "uuid" : "A0EE2DEF-4911-4ABA-8481-CE7B05AE937D",
    "accessed_at" : "2023-12-20T20:46:55Z",
    "created_at" : "2023-12-20T20:46:55Z",
    "folder" : 0
  },
  {
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "content" : "It seems so intuitive in my eyes now. What has the ability to be learned, this abstract material told to us is knowledge, can only ever reveal the material, the physical, the place obverse to you. There is neither song nor text nor teaching that can quell this obfuscation in your stead. There is only the ability for you observe the form of this separation.\n\nHow can it be any other way? How can be here in this land, a child can be born into nothing, possess nothing, learn nothing, and live a full life in more bliss and daily satisfaction than the most sophisticated of men?\n\nA newborn has within them the wisdom that endows happiness like a boundless spring. Material knowledge is not useless in the pursuit of happiness, of course. Perhaps soon will it be justified, that the abstract tends toward the immaterial.",
    "accessed_at" : "2023-12-21T19:10:38Z",
    "modified_longitude" : -81.353180689592122,
    "flagged" : false,
    "folder" : 0,
    "created_at" : "2023-12-21T19:03:31Z",
    "created_longitude" : -81.352936736597499,
    "uuid" : "B2742B88-3B9B-42DA-BF7B-5755D96F1CB8",
    "modified_at" : "2023-12-21T19:29:48Z",
    "modified_latitude" : 28.66184437188209,
    "created_latitude" : 28.663148620769324
  },
  {
    "folder" : 0,
    "tags" : [

    ],
    "created_latitude" : 28.597598796225174,
    "accessed_at" : "2023-12-21T20:16:15Z",
    "uuid" : "EB9BCC9E-7B10-49C8-8466-0E4C114B7CC1",
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-12-21T20:21:15Z",
    "modified_longitude" : -81.287644573090844,
    "content" : "Self Worth.\nLove and Sex.\nParalyzing fear of the cycle of trauma.\nMy eldest brother.",
    "modified_latitude" : 28.598342120092077,
    "created_at" : "2023-12-21T20:16:15Z",
    "created_longitude" : -81.288191117611689,
    "flagged" : false
  },
  {
    "created_latitude" : 28.595039114138014,
    "modified_longitude" : -81.284441913536995,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "modified_at" : "2023-12-21T21:05:56Z",
    "modified_latitude" : 28.594515172786238,
    "uuid" : "A2C2A53A-AFB2-4243-92A4-C86B8B850A04",
    "accessed_at" : "2023-12-21T20:45:13Z",
    "flagged" : false,
    "content" : "Inside the seed of a tree is the wisdom to shoot its arms and leaves in all directions, spreading itself wide in verdant arrogant divinity, with many emerald hands fervently clasped in blind devotion, cupped in unabashed readiness to receive that warm blessing so, an answered prayer each leaf stands to be.",
    "created_longitude" : -81.284578087848601,
    "folder" : 0,
    "created_at" : "2023-12-21T20:45:13Z"
  },
  {
    "created_longitude" : -81.241516326205073,
    "created_latitude" : 28.597559291467544,
    "flagged" : false,
    "uuid" : "70276AF6-2D18-4FFC-BE47-4A902049A9DB",
    "modified_at" : "2023-12-22T07:12:05Z",
    "modified_latitude" : 28.594515102896036,
    "accessed_at" : "2023-12-22T07:07:33Z",
    "created_at" : "2023-12-22T04:52:35Z",
    "content" : "Life...\n\n... is not the finished, final sculpture, but the errant words and feelings lost in sculpting.\n \n... is in the meager ember burning in its willful movement.\n\n... is the bite of the forbidden fruit, poisonously defiant.",
    "tags" : [

    ],
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.284442130660992
  },
  {
    "uuid" : "72EDAEE7-E740-4826-A14B-8BA0F488A2DE",
    "tags" : [

    ],
    "modified_longitude" : -81.284471014590267,
    "created_longitude" : -81.284471014590267,
    "modified_latitude" : 28.594511300352064,
    "folder" : 0,
    "content" : "What is in a hearts' shadow?",
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.594511300352064,
    "flagged" : false,
    "created_at" : "2023-12-22T06:54:11Z",
    "accessed_at" : "2023-12-22T06:54:11Z",
    "modified_at" : "2023-12-22T07:03:56Z"
  },
  {
    "created_at" : "2023-12-22T07:41:10Z",
    "modified_longitude" : -81.284442130660992,
    "content" : "In deep meditation, I have come to see it. Knowledge is necessary for wisdom, but for no more reason than that a comparison necessitates a baseline. Knowledge, seen to my eyes, is the personal ink that stains all that is not wisdom.",
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "uuid" : "41840590-64EE-426B-8AC0-DE3BFCD3FB78",
    "modified_at" : "2023-12-22T09:09:31Z",
    "folder" : 0,
    "tags" : [

    ],
    "accessed_at" : "2023-12-22T07:41:10Z",
    "created_longitude" : -81.284454741119475,
    "modified_latitude" : 28.594515102896036,
    "created_latitude" : 28.594491643398378
  },
  {
    "content" : "Do not be fooled into chasing the veil of life that others present themselves, for your greatest efforts and sacrifices on your closing in would be in vain upon this veil, of lies and bitter disappointment it can only reveal itself to be, forever a lifetime away.",
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "folder" : 0,
    "created_at" : "2023-12-23T22:40:51Z",
    "tags" : [

    ],
    "accessed_at" : "2023-12-26T01:25:43Z",
    "uuid" : "CE0C786B-0E7F-489D-934D-CF2B9CD9C90C",
    "modified_longitude" : -81.284442667113623,
    "created_latitude" : 28.594514604412733,
    "modified_at" : "2023-12-23T22:56:15Z",
    "modified_latitude" : 28.594514604412733,
    "created_longitude" : -81.284442667113623
  },
  {
    "tags" : [

    ],
    "modified_at" : "2023-12-29T18:33:40Z",
    "content" : "If it is true that subjectivity is king in this reality, if a single thought can strike a mind with elation, throughly cleave another in absolute terror, and through another still can be lost without regard... what can reliably be said for the value of thought?",
    "created_longitude" : -81.155806818452561,
    "modified_latitude" : 28.501863198680432,
    "uuid" : "31A5247C-DA52-42AB-BA16-AA4FA29BC807",
    "folder" : 0,
    "languageGrammar" : "Markdown",
    "accessed_at" : "2023-12-29T17:53:31Z",
    "created_at" : "2023-12-29T17:53:31Z",
    "flagged" : false,
    "created_latitude" : 28.500941136002208,
    "modified_longitude" : -81.150144076439744
  },
  {
    "accessed_at" : "2023-12-30T22:02:51Z",
    "tags" : [

    ],
    "created_at" : "2023-12-29T21:42:51Z",
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.163941422720598,
    "created_latitude" : 28.590494440895114,
    "flagged" : false,
    "modified_latitude" : 28.561881884437032,
    "uuid" : "EF4B2304-82F1-47AC-B0EA-31C14C6D6D29",
    "folder" : 0,
    "created_longitude" : -81.198788518161663,
    "modified_at" : "2023-12-29T22:01:59Z",
    "content" : "What about a boar would about a boar to bare out a bore aboard a boat bared by a boor bore of a boar?"
  },
  {
    "modified_longitude" : -81.284437738501396,
    "created_latitude" : 28.377204162705809,
    "content" : "Art is a clear iridescent shard centered in the darkroom of opinion, an empty canvas for those particular personal formulations and thoughts, streaming in endless, perfect illumination through the crystal and through refraction upon the walls, splattered in color bare the exceptional, the unheard of, the unknowable, and so it is reached here that art is an encroachment upon the divine, the eternal, felt in those moments of loving attendance to an infinite internal.",
    "tags" : [

    ],
    "created_at" : "2023-12-30T22:03:29Z",
    "accessed_at" : "2024-01-05T18:45:58Z",
    "uuid" : "878EEBF0-2017-4047-ABBE-37C2E7237C39",
    "modified_latitude" : 28.594512354849069,
    "created_longitude" : -81.244381490056497,
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-01-03T23:58:17Z",
    "folder" : 0
  },
  {
    "uuid" : "3C188A24-22B9-46B6-A9BB-A52CC0E42674",
    "accessed_at" : "2024-01-05T19:56:54Z",
    "languageGrammar" : "Markdown",
    "folder" : 1,
    "flagged" : false,
    "modified_latitude" : 28.553058815364412,
    "modified_at" : "2024-01-05T19:47:34Z",
    "created_latitude" : 28.594534172986247,
    "content" : "... and can it not ",
    "created_at" : "2024-01-05T18:46:01Z",
    "created_longitude" : -81.28444283881872,
    "tags" : [

    ],
    "modified_longitude" : -81.359592672460536
  },
  {
    "modified_at" : "2024-01-05T20:11:33Z",
    "modified_longitude" : -81.482913463014796,
    "accessed_at" : "2024-01-05T21:23:58Z",
    "folder" : 0,
    "modified_latitude" : 28.551676700017492,
    "uuid" : "1A53F09C-7DF0-4C21-97C2-A4A3FA8A7B59",
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "created_latitude" : 28.553092841221048,
    "content" : "... I stand, at place where what lies",
    "created_longitude" : -81.362489622602808,
    "tags" : [

    ],
    "created_at" : "2024-01-05T19:47:48Z"
  },
  {
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-01-05T20:46:48Z",
    "content" : "Masochism!! Like trying to draw blood from this pure stone.",
    "modified_longitude" : -81.672468954597903,
    "created_at" : "2024-01-05T20:13:42Z",
    "accessed_at" : "2024-01-05T20:13:42Z",
    "created_latitude" : 28.551957703501422,
    "modified_latitude" : 28.599442532925345,
    "tags" : [

    ],
    "flagged" : false,
    "folder" : 0,
    "uuid" : "5270E390-D1EB-41E8-8E85-3856102974CA",
    "created_longitude" : -81.489676573109364
  },
  {
    "folder" : 0,
    "tags" : [

    ],
    "content" : "",
    "uuid" : "F5E35D8F-38EE-4A13-9E59-0A3E8A696772",
    "created_at" : "2024-01-05T20:57:27Z",
    "created_longitude" : -81.678532679636859,
    "modified_longitude" : -81.670447194511908,
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-01-05T21:18:01Z",
    "flagged" : false,
    "accessed_at" : "2024-01-05T21:23:26Z",
    "created_latitude" : 28.601242004261881,
    "modified_latitude" : 28.600521180173708
  },
  {
    "tags" : [

    ],
    "flagged" : false,
    "created_longitude" : -81.307609053250559,
    "accessed_at" : "2024-01-12T20:56:21Z",
    "languageGrammar" : "Markdown",
    "uuid" : "CDEE7042-D978-4E6C-9054-74816CF74025",
    "modified_at" : "2024-01-09T19:28:21Z",
    "modified_latitude" : 28.594512101172757,
    "created_at" : "2024-01-09T18:29:47Z",
    "created_latitude" : 28.605794098100628,
    "folder" : 0,
    "content" : "There is to be found, as I have, unending comfort in the experience of the total and opposite extremes in tangibility of identity. A firm, solidly defined sense of self is emboldening. It enables the intuitive determination of one's agency, minimizing the awful rumination that springs from burdens self-imposed, or of judgements unearned. Not only is what is in personal control unshakably delineated, but the extent of that control is monitored and checked.\n\nIn opposition is the total lack of personal identity, a state similarly bathed in comfort and security. The level of dissolution in these moments are simply incomparable to what I've come to know in chronic dissociation. It cannot be more succinctly described than to say, it is the total inverse experience of that sharply defined identity, the inverse of the total control of 'you', in all aspects and senses. Could this comfort be infantilizing and familiar? Or is it, in essence, no different than what we know to be a sense of complete identity? Cannot it not be believed that the relinquishing of agency is itself, a determination of agency? Could it be permitted that 'claimed' control be left on the table, as well as the identifying delineation of tables themselves?\n\nBetween these two ends of the spectrum lie a zone of little comfort. Beings possessing ever shifting identities, we must contend with control granted and ripped away, the capricious pain invariably inflicted upon us.",
    "modified_longitude" : -81.284439466638375
  },
  {
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "created_at" : "2024-01-12T20:56:22Z",
    "modified_at" : "2024-01-12T22:40:15Z",
    "modified_longitude" : -81.284483174385812,
    "accessed_at" : "2024-01-13T20:42:03Z",
    "content" : "A paintings' frontside may deliver the most fatal of emotional afflictions to those who view it, yet to view its obverse would decidedly inflict nothing. If art may be reduced to specific meaningful arrangements of matter, energy and time, then it is this definition that absorption of the audience into the very fabric of the canvas is trivially permissible.\n\nThe role of an audience member is simultaneously to view and be viewed; to experience art is to become a part of it. Ones viewpoint is unique and unexpected; the artist can only consider their own. Unavoidable discrepancies abound; new perspectives offer newer interpretations.\n\nI cannot think of what interests me more in this life. This dance of context and juxtaposition, of objects wielding both no power and seemingly infinite potential, is irresistible to my mind. It is irresistible because it is explanatory, in the particular way that satisfies whatever cranial hunger most reserve until their prayer and their piety. What we search for in those spiritual moments are often sensations of connectedness and shared experience. It is exactly these sensations that come over me, awash in fervor attendance to this dance. \n\nFeeling in terms of undefined, endless context in all things is to feel the slightest glimpse into the storybook of the universe. Not into a particular chapter or scene of the tome. No, in despite of, or exactly because of, what it has done to me, I only feel the burning desire to genuflect against the revelation of but the smallest corner of the grandest index.\n\n\nThe artists' canon must be respected, but it mustn't need strict adherence.\n\nIt cannot be denied that it is an artists distinct vision that is required to bring art into existence. However, it is equally required of the audience to recognize the materialized vision as art, as well to continue doing so for a length of time. These two requirements act as distortions when applied to an art piece, slowly corroding original intention. Perhaps, it is fair to say that the artist can never supply their audience with pristine projections of their mind, just as the audience can never perfectly grasp what should be conveyed with only a flawed incarnation accessible. In one direction; a restriction of expression. In another; a restriction of concession.\n\nDealing with these truths is not done despairingly, in solemn frivolity. The truth birthed upon these crossroads of confinement inspire exhilaration above all else! It is the bare truth that art created is not in the vision of the artist. It is also not created in the vision of the audience. It is serviced by these visions, echoes of the personal and subjective, felt but never seen. What the art has become, what all art essentially is... is some third, new thing, again uniquely arranged in that emergent brilliant radiance of specific, universal love.",
    "created_longitude" : -81.284483662349317,
    "folder" : 0,
    "flagged" : false,
    "created_latitude" : 28.594526584337796,
    "uuid" : "EF1BDC2E-FC50-48F6-ACCF-E9C545A6340C",
    "modified_latitude" : 28.594526249143406
  },
  {
    "created_longitude" : -81.37436335846661,
    "modified_at" : "2024-01-19T07:12:12Z",
    "tags" : [

    ],
    "modified_longitude" : -81.284437275205406,
    "content" : "The Adult is an emergent result, intersected by a similarly induced system - The Community - and one that is innate and seemingly still viable even now - The Child. It is natural that what emerged did so together, and in balance. The Community devoid of The Adult is only ever anarchic, The Adult devoid of The Community only personally disadvantageous.",
    "accessed_at" : "2024-01-19T06:57:25Z",
    "created_latitude" : 28.663737012374014,
    "languageGrammar" : "Markdown",
    "created_at" : "2024-01-13T20:42:04Z",
    "folder" : 0,
    "uuid" : "EFA879DF-7A1D-4DD0-9883-E498CEFDD50E",
    "modified_latitude" : 28.594517078299486,
    "flagged" : false
  },
  {
    "content" : "Any set of numbers can posses any arithmetic average, provided they be gifted that particular, perfect value. How comparable this loving fact is to me, to all matters and aspects of perspective, to the hidden significance of the individual, and most powerfully, to the firmness of my position within and beyond it.",
    "uuid" : "D89A211A-CDFE-40E2-BE13-2A59FAD49E13",
    "tags" : [

    ],
    "accessed_at" : "2024-01-19T00:40:47Z",
    "created_latitude" : 28.569756061796628,
    "modified_latitude" : 28.561885426210832,
    "created_at" : "2024-01-19T00:40:47Z",
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "modified_at" : "2024-01-19T00:55:57Z",
    "folder" : 0,
    "modified_longitude" : -81.163884271801024,
    "created_longitude" : -81.237169168965181
  },
  {
    "modified_at" : "2024-01-19T21:54:37Z",
    "created_latitude" : 28.595239474803307,
    "created_at" : "2024-01-19T21:38:05Z",
    "folder" : 0,
    "created_longitude" : -81.286009217255526,
    "tags" : [

    ],
    "content" : "The seemingly still debated definition on the sanctity of life is a determination of value strictly within the domain of society. It is likely that rational analysis and scrutiny has, in its encyclopedic range, already fixed a useful-enough definition; that life is an emergent property of a system, not present in any one particle within its environment. The vagueness of its form and the fuzziness of its edge is an intentional testament of and onto itself.",
    "flagged" : false,
    "accessed_at" : "2024-01-19T21:38:05Z",
    "modified_latitude" : 28.595222077256839,
    "languageGrammar" : "Markdown",
    "modified_longitude" : -81.28598287815862,
    "uuid" : "694F6829-20BF-4C36-9702-6D4C686AFB0A"
  },
  {
    "content" : "My experience is anecdotal, still is it no less than yours.",
    "modified_latitude" : 28.59451758261493,
    "folder" : 0,
    "created_at" : "2024-01-20T17:14:57Z",
    "flagged" : false,
    "created_longitude" : -81.284436949839943,
    "uuid" : "762B3C85-7BBC-4377-8CBA-14B23F696FDC",
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-01-20T17:16:57Z",
    "accessed_at" : "2024-01-21T09:00:02Z",
    "created_latitude" : 28.59451758261493,
    "modified_longitude" : -81.284436949839943
  },
  {
    "created_at" : "2024-01-21T09:00:10Z",
    "created_longitude" : -81.284438136389753,
    "accessed_at" : "2024-01-21T09:02:00Z",
    "content" : "The belief in the eternity of 'breakthroughs' as they pass through a mediating mind is sustained regardless of the true reality of those realizations, as in defining them exactly to be whatever affectations of profundity that occur in the present is also the immortalization of mental influence, indefinitely yet imperceptibly.",
    "modified_at" : "2024-01-21T21:34:29Z",
    "modified_latitude" : 28.595080965452347,
    "folder" : 0,
    "created_latitude" : 28.594532881945824,
    "tags" : [

    ],
    "languageGrammar" : "Markdown",
    "uuid" : "25987E1D-88FF-4433-883C-6EE221947BA9",
    "flagged" : false,
    "modified_longitude" : -81.285544814035589
  },
  {
    "created_at" : "2024-01-22T16:34:15Z",
    "modified_latitude" : 28.595204441834785,
    "content" : "The corruption of love and fear, both twisted and shaped so as to appear indiscernible in the locality of one's mind; deepest despair becomes the pinnacle of adoration, authentic love morphs into instruments of terror.",
    "created_longitude" : -81.286428543714251,
    "tags" : [

    ],
    "folder" : 0,
    "created_latitude" : 28.596389985115866,
    "uuid" : "706A46AC-1C53-45F3-BBB0-539E048042D0",
    "accessed_at" : "2024-01-31T21:26:18Z",
    "flagged" : false,
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-01-31T21:31:59Z",
    "modified_longitude" : -81.285974560381149
  },
  {
    "created_longitude" : -81.201921606170757,
    "accessed_at" : "2024-02-09T05:58:17Z",
    "uuid" : "E39B26E1-5131-46C9-A0A7-60251CFFDBF1",
    "languageGrammar" : "Markdown",
    "flagged" : false,
    "created_at" : "2024-02-01T22:40:53Z",
    "folder" : 0,
    "modified_longitude" : -81.203455858593671,
    "created_latitude" : 28.601679746242883,
    "content" : "Perhaps now I can label it, the internal phenomenon that had invariably gripped my mind throughout my life, and which has again taken hold of me. A negative state of being I comfortably took refuge in, spacious enough to include both body and brain with crushing vice. Through careful understanding, I know now that what I am referring to is the effects of depleted serotonin levels within my brain. Through intentional induction of this state, I have learned what it constitutes when related to my intimate experiences.\n\nThe feeling of depleted serotonin is the feeling a unadulterated restlessness. Desires arrive and depart in uncontrollable ways, to the point where to associate yourself with one is to be left behind by a barreling train of thoughts. Fleeting and ephemeral, yet simultaneously intensely painful to interact with. To indulge a desire, by satisfying a sweet craving, or enjoying entertainment for example, is inevitably fruitless by this very mechanism. It seems as though what I desire is simply to desire and nothing else, and so the sweets turn to dust between my lips, enjoyment becomes a synonym for voluntary torture, and the search begins renewed.\n\nMy knowledge of all occurring within me does little to quiet these phenomena, however it does allow a degree of attribution. The ability to ascribe all these negative feelings to a singular concept works to create separation within my mind, between what I am in control of and what I am not. The value of this sort of distancing is evident, even now.",
    "modified_at" : "2024-02-01T23:25:16Z",
    "modified_latitude" : 28.60215810815609,
    "tags" : [

    ]
  },
  {
    "uuid" : "5C10A22B-2059-4D34-BD9E-07B2B45E1E03",
    "languageGrammar" : "Markdown",
    "created_longitude" : -81.284440265580912,
    "modified_longitude" : -81.284441199466187,
    "folder" : 0,
    "modified_latitude" : 28.594521567966968,
    "created_at" : "2024-02-09T05:58:19Z",
    "created_latitude" : 28.594521348603067,
    "modified_at" : "2024-02-11T06:51:12Z",
    "tags" : [

    ],
    "accessed_at" : "2024-02-11T06:43:54Z",
    "flagged" : false,
    "content" : "To find enjoyment in learning, one need only solute the plane where growth intersects leisure."
  },
  {
    "created_longitude" : -81.284441199466187,
    "accessed_at" : "2024-02-11T09:43:34Z",
    "created_latitude" : 28.594521567966968,
    "tags" : [

    ],
    "flagged" : false,
    "uuid" : "FE4F0DA8-3A26-4464-AA17-9CAED2654EF7",
    "modified_latitude" : 28.594521567966968,
    "modified_longitude" : -81.284441199466187,
    "folder" : 0,
    "content" : "Their effort wasn't missing, just misguided.",
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-02-11T09:43:52Z",
    "created_at" : "2024-02-11T09:43:34Z"
  },
  {
    "created_at" : "2024-02-12T18:39:54Z",
    "folder" : 0,
    "created_longitude" : -81.200140818350192,
    "flagged" : false,
    "modified_latitude" : 28.603668584500326,
    "content" : "A persistent concern of mine laid in the dissonance present in life daily. Dissonant distance between I and desire, desire I designed that so dissent may transpire. Presented now, not persistent but plainly acquired, so too the liberation of effects so damaging, made.",
    "uuid" : "D7374B73-4C5B-46F1-A0C0-74BF392802FC",
    "accessed_at" : "2024-02-16T01:55:28Z",
    "created_latitude" : 28.603656775431357,
    "tags" : [

    ],
    "modified_longitude" : -81.200141251556786,
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-02-12T19:20:02Z"
  },
  {
    "created_longitude" : -105.51104074513793,
    "modified_longitude" : -80.94545132409344,
    "languageGrammar" : "Markdown",
    "modified_at" : "2024-02-21T10:55:28Z",
    "uuid" : "DC7673A8-7E74-4E85-8210-5E997BCF2752",
    "created_at" : "2024-02-16T01:55:29Z",
    "created_latitude" : 40.380652162726491,
    "flagged" : false,
    "accessed_at" : "2024-02-24T22:19:53Z",
    "tags" : [

    ],
    "folder" : 0,
    "content" : "Hate, in all its quiet unfurling, has come to me to be synonymous with that personal kind of ignorance. I cannot find hate in what I have felt to have grasped fully within myself. To understand animosity, to illuminate all angles of influence until no shadows of ambiguity remain, renders it painfully mortal. How can I hate the flowing water that crashes below every waterfall? There is surely no malevolent intention within each falling drop, only the subject of cause and effect far beyond itself. So it is for any and all all phenomena ever served to my mind. So it is, that hatred can finally fade from its view.",
    "modified_latitude" : 35.217910590312414
  },
  {
    "modified_latitude" : 39.936500314124537,
    "modified_at" : "2024-02-21T08:32:58Z",
    "tags" : [

    ],
    "flagged" : false,
    "created_longitude" : -104.96097610774827,
    "created_latitude" : 39.936500314124537,
    "created_at" : "2024-02-21T08:05:44Z",
    "accessed_at" : "2024-02-21T08:05:44Z",
    "uuid" : "25210EA8-FC94-4618-B1E7-77E389F72CA5",
    "languageGrammar" : "Markdown",
    "folder" : 0,
    "modified_longitude" : -104.96097610774827,
    "content" : "What is it that turns my heart over in place so? To which set should I ascribe endless excitement that here I possess? I seemingly cannot nail down this entity invading me, to do so would imply an ounce of materiality, and perhaps more critically some amount of mortality. It is something elusive, simply elegant. Never found is it, not in a word, or a note or a step. Instead it lives in the space made between words, in the cliffs borne of cadence, in the journey only just imagined. Transient, in that I do not enjoy the sight of record nearly as much as I do to witness what results from its turning. "
  }
]